{"unique_id":"pj_3b7d62ddf5b8eed9","city":"Massachusetts","job_qry":"data","job_title":"Sr. Data Analyst","company_name":"Raybeam, Inc.","location":"NOT_FOUND","link":"https:\/\/www.indeed.com\/viewjob?jk=3b7d62ddf5b8eed9","summary":"Please do not apply through Indeed.The only way you will be considered is if you follow the link at the bottom of the page and take a very short quiz.What are we looking for?We are looking for a technically savvy database-oriented Analyst with good people skills and the ability to pick up new business concepts and technologies.The ideal candidate will possess: At least 4 years of experience.A strong to very strong working knowledge of SQL and Python.An ability to write and troubleshoot complex SQL procedures.The desire to understand business events through data.An understanding of Data Warehousing and ETL techniques.High level understanding in at least one scripting language such as Ruby, Shell, Python.An interest in learning large data set processing with MapReduce\/Hadoop\/Pig\/etc.Linux skills are a plus.Good client relations skills strongly preferred.Who are we?Raybeam, Inc. is a software engineering and consulting company focused on strategic consulting, business intelligence, and online\/database marketing for the past fifteen years. We have offices near Boston and San Francisco and support a strong list of clients including Google, Facebook, Microsoft, eBay, Disney, One Kings Lane, Beachbody and Hilton Worldwide.What do we do?We provide technology solutions by architecting and developing enterprise systems using a variety of programming languages, tools and platforms. This can range from building data warehouses, to web applications to implementing reporting platforms. We work in small teams, own the projects that we work on, and have direct input into the business decisions of our clients.What do you get from working for Raybeam?A fun, supportive work environment that promotes camaraderie and growth.The chance to travel and network with important figures in the industry.The chance to have input into business decisions of our clients.The opportunity to learn technologies that you've always wanted but never had the chance.If you are interested in applying for the position please click on the link below to take a short quiz.http:\/\/careerseval.raybeam.com\/sign_inPlease note that Raybeam, Inc. is currently unable to provide sponsorship and we will only consider local candidates. Recent grads are encouraged to apply, and an MBA is desirable. Thank You.Job Type: Full-timePay: $110,000.00 - $150,000.00 per yearBenefits:401(k)401(k) MatchingDental InsuranceDisability InsuranceFlexible ScheduleHealth InsuranceLife InsurancePaid Time OffParental LeaveReferral ProgramVision InsuranceSchedule:Monday to FridaySupplemental Pay:Bonus PayCOVID-19 considerations:Due to COVID, all employees are currently working remotely. When it is safe to do so, we will return to the office.Location:Newburyport, MA (Required)Work authorization:United States (Required)Company's website:www.raybeam.comBenefit Conditions:Only full-time employees eligible","salary":"\n$110,000 - $150,000 a year","date":"Just posted","full_text":"NOT_FOUND"}
{"unique_id":"pj_e79708ab07dffe20","city":"Massachusetts","job_qry":"data","job_title":"Visitor Services Representative","company_name":"Cape Ann Museum","location":"NOT_FOUND","link":"https:\/\/www.indeed.com\/viewjob?jk=e79708ab07dffe20","summary":"Job SummaryReporting to the Visitor Services Manager, Visitor Services Representatives are the first contact with Museum visitors and play a vital role in providing a quality visitor experience. Successful candidates must be comfortable working in a fast-paced environment, as they perform a variety of duties including selling general admission, event and programming tickets as well as Museum Memberships while providing exceptional customer services in person and over the phone.Key ResponsibilitiesProvide a warm and engaging customer service experience to all visitors and maintain a well-informed, working knowledge of Museum exhibitions, partnerships and public programs.Assist with daily operations including, admissions sales, event and programming tickets, membership processing and data collection.Facilitate visitor support and wayfinding, manage entrance lobby to ensure timely and courteous processing of both individual and group visitors.Process gift shop sales and assist with entering gift shop inventory and product restocking.Respond to general telephone and email inquiries.Maintain cleanliness and organization of entrance lobby and front desk, re-stock museum maps, membership brochures and program guides as needed.Support the general operations and activities of the Museum in other duties as assigned by the Visitor Services Manager.Assist docents in preparation of guided tours.QualificationsExcellent customer service and communication skills.At least 6 months of related experience including; cash handling experience preferred.Poise, maturity, flexibility and aptitude to work as a collaborative team player in multi-tasking environment with demonstrated flexibility to meet shifting demands and priorities.Knowledge of ticketing and point of sales system as well as strong computer skills including MS Word and Excel.Appreciation of the Museum’s mission preferred.Ability to work some nights, early mornings and weekends as events and meetings require.Capability to lift up to 20Ibs and capacity to stand for extended periodsThurs-Sun 10 a.m. - 3 p.m.Some flexibility may be required.The Cape Ann Museum is committed to diversity among its employees and encourages qualified candidates from all backgrounds to apply.Job Type: Part-timePay: From $15.00 per hourSchedule:WeekendsCOVID-19 considerations:To keep our employees safe, we have installed a glass divider at the reception desk and we provide masks, gloves and hand sanitizer. We follow all CDC recommendations.Experience:customer service: 1 year (Preferred)Education:High school or equivalent (Preferred)Work Location:One locationMultiple locationsCommunication method(s) used:EmailPhoneIn personTypical start time:10AMTypical end time:5PMWork Remotely:No","salary":"\nFrom $15 an hour","date":"Just posted","full_text":"NOT_FOUND"}
{"unique_id":"p_f1b032124a578ef2","city":"Massachusetts","job_qry":"data","job_title":"Data Analyst (Part-time)","company_name":"Holyoke Public Schools","location":"Holyoke, MA","link":"https:\/\/www.indeed.com\/viewjob?jk=f1b032124a578ef2","summary":"Primary Location FINANCE & OPERATIONS\n\nSalary Range PART TIME (12 MONTH)\n\nShift Type Part-Time","salary":"NOT_FOUND","date":"Just posted","full_text":"NOT_FOUND"}
{"unique_id":"pj_f93ad49216c36d84","city":"Massachusetts","job_qry":"data","job_title":"Quality Inspector\/ CMM Programmer","company_name":"TML Manufacturing\/Technimetals","location":"NOT_FOUND","link":"https:\/\/www.indeed.com\/viewjob?jk=f93ad49216c36d84","summary":"CMM Programmer \/ Inspector Job Description Job Responsibilities: Provide CMM programming and operation supporting the quality and manufacturing departments. Maintains quality standards by approving incoming materials, in-process production, and finished products; recording quality results.Job Duties:  Programming and operating CMM equipment; Brown & Sharpe automatic, semi- automatic and Keyence. Control all aspects of inspection equipment calibration. Keeps measurement equipment operating by following operating procedures and work instructions; following calibration due dates. Assist with documentation control through ISO Standards. Inspects incoming and\/or in-process production machined components by confirming specifications; conducting visual and measurement tests; communicating required adjustments to production supervisor\/leader. Conducts First Article Inspections (FAI’s) and documenting results. Documents inspection results by completing reports and logs; completing NCMR’s,CAR’s when required; inputting data into quality database. Maintains safe and healthy work environment by following standards and procedures; complying with legal regulations. Updates job knowledge by participating in educational opportunities; reading technical publications. Accomplishes quality and organization mission by completing related results as needed. Other tasks as assigned.CMM Programmer \/ Inspector Job DescriptionIssue Date: 16-Jan-20Page 1* of 2*Skills and Qualifications: CMM Programming, Analyzing Information, Able to interpret Blueprints\/Drawings, ReportingResults, Documentation Skills, Promoting Process Improvement, Manufacturing Methods andProcedures, Supports Innovation, 3D Modeling, Inspection\/Measurement equipment.Education: Technical (Trade) School Certificate, Associate Degree, Bachelor DegreeReports to: Quality ManagerCMM Programmer \/ Inspector Job DescriptionIssue Date: 16-Jan-20Page 2* of 2*Job Type: Full-timeWork Location:One locationBenefits:Health insuranceDental insuranceRetirement planPaid time offTypical start time:8AMTypical end time:4PMPay Frequency:Bi weekly or Twice monthlyThis Job Is Ideal for Someone Who Is:Dependable -- more reliable than spontaneousAdaptable\/flexible -- enjoys doing work that requires frequent shifts in directionDetail-oriented -- would rather focus on the details of work than the bigger picture","salary":"NOT_FOUND","date":"Just posted","full_text":"NOT_FOUND"}
{"unique_id":"pj_42b310de4665aae2","city":"Massachusetts","job_qry":"data","job_title":"Agent I Contact Center","company_name":"Retail Business Services, LLC","location":"NOT_FOUND","link":"https:\/\/www.indeed.com\/viewjob?jk=42b310de4665aae2","summary":"Retail Business Services, LLC, is the services company of Ahold Delhaize USA, currently providing services to five East Coast grocery brands, including Food Lion, The GIANT Company, Giant Food, Hannaford and Stop & Shop. Retail Business Services leverages the scale of the local brands to drive synergies and provides industry-leading expertise, insights and analytics to local brands to support their strategies with services including Information Technology, Merchandising, Marketing & Sourcing Services, Private Brand Products, Pharmacy Services, Not for Resale, Store Services, Financial Services, Legal Services, Communications, Supply Chain and People Systems and Services. Retail Business Services operates across seven campuses in the Greater Charlotte, Harrisburg, D.C., Portland, Boston and Chicago Areas. For more information, visit www.retailbusinessservices.com. To stay updated with the latest news, follow Retail Business Services on LinkedIn (@Retail-Business-Services) and Twitter (@RBServicesNews).Position Title: Agent I Contact CenterPosition Location: Quincy, MAPosition Summary:The Customer Agent will be responsible for providing direct support to store personnel, as well as customers, in an effort to ensure proper service levels are met on a 7 day x 24 hour basis. Provide excellent customer service to both internal and external customers. Enhance customer loyalty through engagement via phone and email. Provide clear information or direction with regard to actions required by customers (internal and external) in order to fully address their concerns. Provide direct support to store personnel and customers for Technology, Merchandising, Store Maintenance, Operations, Order Add\/Cuts, Order call Block Polling; online orders; digital offers; and loyalty programs.Principle Duties and Responsibilities:> Work with customers and stores to document, resolve and\/or escalate problems being reported. As part of the process, record required contact information and problem description in the appropriate application. Call content, appropriate notifications, error messages, problem classification and severity are critical to the problem review and resolution process.> Strive to provide appropriate resolution at the first point of contact.> Gather data during the problem solving process, analyze the situations, and provide solutions.> Utilize logical problem-solving skills and techniques to troubleshoot and resolve complex problems reported by stores and customers.> Demonstrate excellent writing, grammar, and computer skills in order to meet department standards. Demonstrate empathy and responsiveness to customers’ concerns.> Be alert to urgent or severe issues for immediate escalation, as well as trends that may negatively impact the company.> Take ownership of all calls and cases\/tickets opened; track the contact status to resolution utilizing the appropriate application.> Escalate complex and\/or high priority problems to appropriate coworkers, support groups, or vendors for resolution.> Ensure proper notification and escalation procedures are followed to update business users and customers.> Collaborate with other members of the team to manage calls including, but not limited to: Technology, Merchandising, Store Maintenance, Operations, Order Add\/Cuts, Order call Block Polling issues, Loyalty, Entertaining, and customer concerns.> Support tools\/applications to ensure all steps for error and service recovery have been performed in an effort to resolve reported problems prior to escalating to second level support groups.> Maintain solid documentation of issues as reported inclusive of any recommendations and\/or actions taken. This includes maintaining best practices that will handle the functional requirements for supporting Customer Care, Loyalty, WebCare, Technical, Vendor, and user issues in all stores as well as online.> Receive\/react to contacts from stores and customers> Escalate complex contacts to third level groups> Provide guidance and support to Agent 1 as needed; and when appropriate, assume responsibility for proper handling of said contact> Escalate unresolved issues when appropriate> Add newly provided information to shared document for future reference by the team> Exercise ability to influence other department decisions by providing customer feedback and metrics data (collected from department analyst)> Provide Agent 1 team with necessary training and support to achieve department goals> Monitor contact volume and adjust team responsibilities as needed> Assist Supervisor with scheduling needs> Assist Supervisor with management of team performance> Maintain documentation of processes performed in departmentBasic Requirements:1 - 2 Years of relevant contact center or IT helpdesk experienceBachelor's DegreeJob Type: Full-timePay: $1.00 - $2.00 per hourBenefits:401(k)Dental InsuranceHealth InsuranceLife InsurancePaid Time OffVision InsuranceSchedule:Monday to FridayExperience:Call Center: 1 year (Preferred)","salary":"NOT_FOUND","date":"Just posted","full_text":"NOT_FOUND"}
{"unique_id":"pj_74d9e2f8a98a7345","city":"Massachusetts","job_qry":"data","job_title":"Business Systems Analyst","company_name":"Amphenol Pcd","location":"NOT_FOUND","link":"https:\/\/www.indeed.com\/viewjob?jk=74d9e2f8a98a7345","summary":"Amphenol Pcd is looking to add a Business Systems Analyst to their stellar IT team.\n\nAbout Us:\nAmphenol Pcd (APcd) is a Division of Amphenol Corporation (www.amphenol.com - NYSE: APH), one of the largest manufacturers of interconnect products in the world. At APcd, we are dedicated to providing users in the Commercial and Military-Aerospace markets with a wide variety of high reliability, high performance connectors and rugged system packages. The primary end markets for our products are the commercial and military aerospace industry\n\nBrief Summary of Responsibilities\nAs our Business Systems Analyst, you will be the main contact for issues and projects related to our ERP System as well as manage multiple interface, access and requirements from users related to the Business Application Systems.\n\nEssential Functions:\nTroubleshooting of our ERP as well as managing related projects\nApplication maintenance\nGenerate and customize reports\nProvide maintenance for the SQL Database\n\nRequired Skills\/Experience:\nExperience and understanding of ERP systems – Macola experience a plus\nFamiliar with Exact Synergy\nProgramming in SQL and VBA or similar macros environment\nFluent in English\n\nDesired Skills\/Qualifications:\nProject Management\nMicrosoft BI\nCrystal Reports\n\nMinimum of 3 years directly related experience\n\nDue to the nature of our business, we are unable to provide sponsorship. Position requires candidate to be a U.S. person as defined in ITAR, 22 CFR 120.15 (U.S. Citizenship or Legal Permanent Resident) and defined by 8 U.S.C. 1101(a) (20).\n\nAmphenol Pcd is an Equal Opportunity\/Affirmative Action Employer. All qualified applicants will be given equal consideration regardless of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, pregnancy, genetic information, veteran status, or any other category protected by law.\nThis organization participates in E-Verify","salary":"NOT_FOUND","date":"Just posted","full_text":"NOT_FOUND"}
{"unique_id":"p_4f6f26e5459d1e6b","city":"Massachusetts","job_qry":"data","job_title":"CUSTOMER DATA ANALYST","company_name":"Cytiva","location":"Marlborough, MA 01752","link":"https:\/\/www.indeed.com\/viewjob?jk=4f6f26e5459d1e6b","summary":"Maintain Oracle Customer Master database integrity and ensure efficient screening of our new customers\/current customers\nReview, update, and correct data; delete and\/or merge files containing duplicate information\nObtain further information for incomplete documents\nCheck completed work for accuracy\nHave a zest to learn about the various interfaces connect with Oracle Customer Master\nDevelop an understanding of end to end customer account creation and processes to provide quick and world class experience to our customers\nComply with data integrity and security policies\nCreate and maintain SOPs and User Guides for ways of working\nWorks as part of a global team on different projects and helps with requirement gathering, testing and implementation.\nRun reports in Excel, Access, SQL Developer and inhouse data gathering programs\nParticipate in the creation and maintenance of dashboards that can be used to drive business results\nBuild an understanding of where to get key information and how to present it to the functional and technical teams\nDrive continues improvement by analyzing and challenging business processes to determine the most efficient ways to work\nMaintain filing and records management systems and other office flow procedures which may be confidential","salary":"NOT_FOUND","date":"Just posted","full_text":"NOT_FOUND"}
{"unique_id":"pj_444f6ce3b44cccc6","city":"Massachusetts","job_qry":"data","job_title":"Administrative Assistant (part-time)","company_name":"Renewal by Andersen | Esler Companies","location":"NOT_FOUND","link":"https:\/\/www.indeed.com\/viewjob?jk=444f6ce3b44cccc6","summary":"This is the perfect opportunity for someone who is looking to work for a great company, part-time, and have the ability to grow in the administrative field! The Administrative Assistant role will provide support for the Inside Sales Center reporting directly to our Administrative Supervisor. We are looking for someone who bring some positive energy and can commit to an evening weekend schedule in the office: Saturday 5pm-10pm and Sunday 5pm-9pm.WHAT YOU'LL BE DOING | THE ROLEData EntryDaily office cleaningAnswering phonesFront desk, maintaining a professional demeanorOffice supply replenishingCommunicating with all departments in our call center to determine needsCoordinate meetings and help with any projects as neededWHAT YOU'LL BRING | THE PERSONMust be detail orientedCommunicativeAbility to work in a teamFlexibilityAdaptabilityOrganizedMulti-taskingHigh school diploma or equivalentReliableWHAT'S IN IT FOR YOU | THE BENEFITSPart-time ScheduleCompetitive PayAmazing Corporate culture!THE RENEWAL BY ANDERSEN | ESLER COMPANIES STORYRenewal by Andersen is the full-service window-replacement division of 115-year-old Andersen Corporation, the owner of the most trusted family of window brands in America. RbA was founded with a mission to redefine the industry and to offer a different—and better—window-replacement experience. Renewal by Andersen has seven company-owned locations, and over 100 independently owned “affiliates” across the United States.The Esler Companies is the holding company for a fleet of the top Renewal by Andersen (RbA) “affiliates” in Greater Philadelphia, Colorado, Greater Phoenix, and Southern New England, and a sales and marketing ‘engine’ in Northborough, Massachusetts. Independent affiliates operate with a business model which grants owners exclusive marketing and sales territories, and nearly complete autonomy in running their businesses.Esler Companies | Renewal by Andersen is a proud equal opportunity employer. We are committed to fair hiring practices and to creating a welcoming environment for all team members.Job Type: Part-timePay: $14.00 per hourSchedule:Weekends","salary":"\n$14 an hour","date":"Just posted","full_text":"NOT_FOUND"}
{"unique_id":"pj_eaeda82024fe12c3","city":"Massachusetts","job_qry":"data","job_title":"Warehouse Associate- 2nd shift\/Sunday-Thursday","company_name":"Owens and Minor","location":"NOT_FOUND","link":"https:\/\/www.indeed.com\/viewjob?jk=eaeda82024fe12c3","summary":"WAREHOUSE COORDINATOR -Take the first step toward a career in the healthcare industry!Shift: 2nd shift, Sunday-Thursday; Sunday 7am start time, M-TH 3pm start timeCompensation: $16.00 hourly plus 8% shift differentialCore Job Responsibilities:You will be responsible for ensuring that all warehouse functions are completed accurately and on timeEnsuring the accuracy of all shipping\/receiving documents and maintaining all records relative to shipping\/receiving activitiesAssuring that shipping\/receiving counts match picking\/purchase order documents and assisting in resolving any discrepanciesPicking orders to be shipped, ensure proper labels and paperwork have been applied before shippingVerifying (recounting) orders received by others to ensure accuracy of incoming merchandiseUtilizing material handling equipment, safely and efficiently, to transport product to shipping locations or delivery platforms and ensuring orders are staged in order of deliveryQualifying Experience:General knowledge of math, reading, basic accounting, typing, etc.Prior experience working in a distribution center a plusAble to work in a fast paced, team environmentMust be willing to learn how to use new equipment WMS TechnologyMust adhere to all safety rules and requirementsMust be available to work all overtime hoursTeammates will need to provide their own protective footwearJob Type: Full-timePay: $16.00 per hourBenefits:401(k)401(k) matchingDental insuranceDisability insuranceEmployee assistance programEmployee discountFlexible spending accountHealth insuranceLife insurancePaid time offProfessional development assistanceReferral programRetirement planTuition reimbursementVision insuranceSchedule:8 hour shiftOvertimeCOVID-19 considerations:The safety of our teams is our top priority. We have implemented several safety measures that are practiced every day: mandatory temperature screenings, company provided masks and gloves, hand sanitizer stations & social distancing initiatives.Experience:Pallet Jack: 1 year (Preferred)Cherry Picker: 1 year (Preferred)Forklift: 1 year (Preferred)Warehouse: 1 year (Preferred)Work Location:One locationWarehouse Skills:Forklift experienceData entryPackagingPallet jackThis Job Is Ideal for Someone Who Is:Dependable -- more reliable than spontaneousAdaptable\/flexible -- enjoys doing work that requires frequent shifts in directionDetail-oriented -- would rather focus on the details of work than the bigger pictureCompany's website:www.owens-minor.comCompany's Facebook page:https:\/\/www.facebook.com\/owensandminor\/Work Remotely:No","salary":"\n$16 an hour","date":"Just posted","full_text":"NOT_FOUND"}
{"unique_id":"pj_08d4dd68c20fca36","city":"Massachusetts","job_qry":"data","job_title":"Medical Assistant","company_name":"AFC Urgent Care Swampscott | Beverly","location":"NOT_FOUND","link":"https:\/\/www.indeed.com\/viewjob?jk=08d4dd68c20fca36","summary":"Job SummarySummary: AFC Urgent Care is looking for part and full time MAs to staff our brand new, state of the art urgent care centers in Beverly and Swampscott, MA. Our ideal candidate has all the qualifications listed below, but that's only part of it. The most important part: you treat our patients with the respect, love and care that you'd treat a member of your own family.Everyone walking through our doors is there because they're sick and need help. We're here to send them home with a smile. If we can't do that, we've failed. Successful candidates for this position will never need to be told this twice.Objective: Greet and register patients and handle front office administrative tasks and assist pro-viders in back office patient care.Reports to: Center Administrator \/ Physician on Duty \/ Nurse ManagerResponsibilities and DutiesPrimary Responsibilities (including, but not limited to)Assist in patient care including- Escort patient to room- Take vital signs- Document patient data- Assist provider- Discharge patients from room with instructions- Clean roomEnsure patient flow is speedy and organizedInventory supplies, replenish supplies when receivedAssist in maintaining equipmentEnsure cleanliness of patient waiting area and front office areaGreet and register patientsQualifications and SkillsMinimum of 1 year experience in a medical office settingMA Diploma requiredProfessional appearanceTeam player who is equally comfortable working independentlyWarm, friendly attitude with excellent patient interaction skillsTeam player, excellent verbal and communication skills, adaptable in different situations, possesses excellent client interaction skills, able to multi-task and work independentlyAbility to work 12 hour shifts and weekendsJob Types: Full-time, Part-timePay: $16.00 - $20.00 per hourLicense:Medical Assistant Diploma (Required)Additional Compensation:BonusesWork Location:Multiple locationsBenefits:Health insuranceVision insuranceDental insuranceRetirement planPaid time offFlexible schedule","salary":"\n$16 - $20 an hour","date":"Just posted","full_text":"NOT_FOUND"}
{"unique_id":"p_2f8dd23a4caed999","city":"Massachusetts","job_qry":"data","job_title":"Production Manager","company_name":"Bart's Ice Cream Amherst","location":"Greenfield, MA 01301","link":"https:\/\/www.indeed.com\/viewjob?jk=2f8dd23a4caed999","summary":"A Western MA frozen food manufacturer is a seeking creative, energetic and dynamic person with a passion for food and food preparation to lead our production team and share ownership's vision to grow one of New England's' most iconic brands. The ideal candidate is entrepreneurial, creative, detail oriented with a passion for food and food preparation. This person will be working in a small business environment and will require energy, and problem solving skills while at the same time committed to fostering a positive and creative culture internally.\nResponsibilities\n*Oversee and manage all facets of the frozen food manufacturing process from sourcing ingredients, through production, to management of finished good inventory of 20 - 30 flavors of ice cream *Work will sales team to prepare production plans (30 - 60 days in advance) based on projections and compliance with allergens and FDA guidelines. *Source and organize all production related items (packaging and all natural ingredients) in advance of planned production days (2 -3 days a week). Manage raw goods and ingredient inventory, schedule production team and prepare for all aspects of production. *During 2 -3 production days a week, lead a four person production team in the manufacturing process of premium frozen dessert. Light to moderate manufacturing process with some heavy lifting of various ingredients and\/or inclusions. *Maintain all production related equipment including moderate set up and clean up. *Manage all aspects of production on inventory management using internal inventory management system. Must be comfortable with computers and have a curiosity and willingness to learn. *Responsibilities also include introduction of new flavor and or product ideas on a quarterly basis Customers or always looking for 'whats new' and this candidate will have the opportunity to use their desire to be creative around new flavors or offerings. *Qualifications *Strong desire to be light manufacturing environment with the opportunity to participate in the growth of a brand *Ideally, candidate will have 5 + years of food and food manufacturing experience. Dairy, frozen food is preferred *Experience with light frozen food manufacturing equipment *Serv Safe Certified *Comfortable with MS Office and\/or Google Docs to prepare production plans *Drivers License\n\nWe are looking forward to receiving your application. Thank you.\nAvailable shifts and compensation: We have available shifts all days of the week. Compensation is $25.00 - $30.00\/hour.\nAbout Bart's Ice Cream Amherst: At Barts, we only put what we love in our pints. That means local, high quality ingredients, and as much ice cream as we possibly can! Each and every pint is hand packed by our team of passionate ice cream enthusiasts. From our table to yours!\n\nBy applying to this job, you agree to receive periodic text messages from this employer and Homebase about your pending job application. Opt out anytime. Msg & data rates may apply.\n\nPowered by Homebase. Free employee scheduling, time clock and hiring tools.","salary":"\n$25 - $30 an hour","date":"Just posted","full_text":"NOT_FOUND"}
{"unique_id":"pj_5599862818f6a16c","city":"Massachusetts","job_qry":"data","job_title":"Direct Support Professional","company_name":"NEEDS Center","location":"NOT_FOUND","link":"https:\/\/www.indeed.com\/viewjob?jk=5599862818f6a16c","summary":"COME GROW WITH US!The NEEDS Center has openings for Direct Support Professionals who will assist and support adults with developmental disabilities to live as independently as possible while enjoying all aspects of Community Living. Full time and Part-time positions available in Orleans MA.Payrate is from: $14.85 – $15.30 per hour plus our employee benefits.Our employees enjoy great benefits, such as health insurance, vision, dental, Life Insurance, Disability Insurance, retirement plan, FSA, Tuition Reimbursement and generous paid time off!Responsibilities include: - Assisting and supporting individuals in daily routines.- Implement clinical, educational and vocational programs.- Observe and record data for programs established in their Individual and Behavior support plans.- Participate with other team members to create a therapeutic environment that includes regular community membership.COVID-19 considerations: To keep all staff members safe we provide all safety gear. e.g. masks, gowns, face shields etc.Job Type: Full-timePay: $14.85 - $15.30 per hourBenefits:Dental InsuranceFlexible Spending AccountHealth InsuranceLife InsurancePaid Time OffParental LeaveRetirement PlanTuition ReimbursementVision InsuranceSchedule:Monday to FridayNight ShiftWeekendsExperience:dsp: 1 year (Preferred)caregiving\/direct patient care: 1 year (Preferred)License:driver's license (Required)Work Remotely:No","salary":"\n$14.85 - $15.30 an hour","date":"Just posted","full_text":"NOT_FOUND"}
{"unique_id":"p_2ffdc1e55eb2ecd5","city":"Massachusetts","job_qry":"data","job_title":"Office Assistant","company_name":"Industrial Technical Services, Inc.","location":"Westfield, MA 01085","link":"https:\/\/www.indeed.com\/viewjob?jk=2ffdc1e55eb2ecd5","summary":"We are looking for a competent Office Assistant to help in our Accounts Receivable Department. Candidate will be a hard-working professional able to undertake a variety of office support tasks. This person will be comfortable working with a high degree of attention to detail.ResponsibilitiesEntering data into Quick BooksFiling, Scanning, making copiesAnswering phonesGeneral office tasksSkillsExperience working in an officeKnowledge of Quick Books a mustWorking knowledge of office equipmentThorough understanding of office management proceduresExcellent organizational and time management skillsAnalytical abilities and aptitude in problem-solvingExcellent written and verbal communication skillsProficiency in MS OfficeJob Type: Part-timePay: From $16.00 per hourBenefits:401(k)401(k) MatchingDental InsuranceDisability InsuranceHealth InsuranceLife InsurancePaid Time OffRetirement PlanVision InsuranceSchedule:Monday to FridayExperience:office assistant: 1 year (Preferred)10 Key: 1 year (Preferred)QuickBooks: 1 year (Preferred)Location:Westfield, MA 01085 (Preferred)Work Location:One locationTypical start time:10AMTypical end time:2PMSetting:OtherErgonomic Workspace:YesFinancial Duties:BillingPayrollCompany's website:www.ITS-control.comBenefit Conditions:Waiting period may applyOnly full-time employees eligibleWork Remotely:No","salary":"\nFrom $16 an hour","date":"Just posted","full_text":"NOT_FOUND"}
{"unique_id":"pj_3b066eb588e28c80","city":"Massachusetts","job_qry":"data","job_title":"Associate, Fraud Risk","company_name":"Santander Holdings USA Inc","location":"NOT_FOUND","link":"https:\/\/www.indeed.com\/viewjob?jk=3b066eb588e28c80","summary":"Associate, Fraud Risk - 2002584\nDescription\n\nThe Associate, Fraud Risk identifies and reports fraud trends, weaknesses\/gaps, fraud mitigation strategies, and fraud detection methodologies. S\/he facilitates policy and procedure changes that will assist in mitigating fraud for customers. The incumbent will support the management and executions for special Fraud Risk projects and\/or programs.\n\nAssists the business unit in determining timeframe and resources to accomplish implementation of control enhancement and direct the business unit through full implementation.\nEnforces all established policies and procedures ensuring strict adherence with all legal, regulatory and compliance mandates and all network operating rules.\nEnsures all operational and servicing requirements are met through overall management of the team, applications, and technology and service bureaus.\nEscalates issues potentially affecting reputation risk to Management, Legal, and Corporate Communications.\nLeverages relationships as liaison with internal and external business partners to facilitate information-sharing opportunities and identification of fraud trends.\nMonitors policies, procedures and internal controls within area of responsibility to minimize exposure to risk, losses and potential fraud.\nNetworks and communicates with local and national fraud analysts form other financial institutions and law enforcement.\nParticipates in fraud mitigation\/security peer groups, such as IAFCI, ACFE, ABA, BITS, etc., to facilitate information-sharing opportunities and identification of fraud trends.\nPrepares and presents anti-fraud training to business unit partners and peers.\nPresents complicated and\/or sensitive issues, as well as industry fraud trends, to senior level management in a concise written or verbal format., Understands and complies with all applicable federal regulations including, but not limited to, Bank Secrecy Act, FCRA, Truth in Lending, Equal Credit Opportunity Act, Right to Financial Privacy Act, RESPA, Gramm Leach-Bliley, and FACTA.\n\nAt Santander, we value and respect differences in our workforce and strive to increase the diversity of our teams. We encourage everyone to apply.\n\nQualifications\n\nBachelor's Degree; Business, Finance, or equivalent field or equivalent work experience required\n5-9 years; Risk Management\/Controls experience\nAbility to adapt and adjust to multiple demands and competing priorities.\nAbility to adjust to new developments\/changing circumstances.\nAbility to convey a sense of urgency and drive issues\/projects to closure.\nAbility to effectively interact with the market, executive management and vendors.\nAbility to handle conflict resolution with other groups to ensure appropriate accounting guidance is followed.\nAbility to identify and report internal control weaknesses\/policy violations in verbal or written form to appropriate levels of management and recognize opportunities for process\/operational improvements.\nAbility to independently operate in a complex, matrixed environment; adept at delivering and maintaining productive working relationships across business, functions, geographies and lines of defense,\nBroad risk management principles, methodologies and tools, governance principles and activity preferably in a financial services technology environment.\nExcellent written and oral communication skills.\nKnowledge of workflow\/processes and risks\/controls, including: origination, underwriting, servicing, and collections\/workout., Strong analytical, organizational and project management skills.\nCommunicates in a timely and straightforward manner.\nProbes for additional information, clarifies assumptions and confirms agreed-upon actions.\nKeeps everyone involved informed about progress and issues,\nCommunicates the importance and benefits of risk management to counterparts.\nDisplays natural skepticism and curiosity to question the status quo and uncover issues.\nAdheres to a good root cause analysis process,\nCreates a good working environment in the team; works towards shared goals contributing ideas and accepting change Provides assistance and coaches less experienced team members.\nExecutes risk management process and procedures without management direction, and demonstrates awareness of expected results.\nKnows the relationship and impact of actions and results.\nHas an understanding of regulations impacting area supported,\nFollows through to meet commitments to others Takes responsibility for achieving strong results, despite balancing multiple complex demands,\nKnows who to reach out to inside and outside of one’s team to get work done.\nTakes action to enhance working relationships needed to achieve seamless work flow.\nStays current with industry and regulatory trends and emerging risk issues.\nHas good understanding of current market and competitive landscape that the organization operates within.\nUses information and data effectively to support a position and present a rational case.\n\nJob : Risk Management Primary Location : Massachusetts-BOSTON-75 State Street - 06366 - State Street-Corp Organization : CRO (8855) Schedule : Full-time\nJob Posting : Aug 21, 2020, 7:53:14 PM","salary":"NOT_FOUND","date":"Just posted","full_text":"NOT_FOUND"}
{"unique_id":"p_2a12018e25dab60a","city":"Massachusetts","job_qry":"data","job_title":"Sr. Database Engineer","company_name":"IMG Systems Inc","location":"Woburn, MA","link":"https:\/\/www.indeed.com\/viewjob?jk=2a12018e25dab60a","summary":"SUMMARY:The Senior Database Engineer will be responsible for the design, development, testing, and maintenance of data warehouses (DW), ETL, and associated Business Intelligence (BI) or application integration infrastructure. The incumbent will work with relational and OLAP databases including the design of new database implementations. The incumbent will provide production support and troubleshooting as well as participate in business projects. The incumbent will provide training, guidance, and assistance to other developer resources (including data extracts). The incumbent should have six or more years’ experience with relational databases, ELT, data modeling, development or architecture experience.ESSENTIAL FUNCTIONS:Perform OLAP database design and developmentPerform ETL design and developmentPerform MuleSoft design and developmentPerform ODI design and developmentPerform analysis of relational and OLAP data sourcesPerform business analysis to determine data needsPerform system analysis to determine best ways to expose data to other systemsDesign and execute unit tests and test plans to verify data integrityIdentify, evaluate, and assist in implementation of new tools and technologiesMaintain awareness of industry developmentsProvide task breakdowns and estimates for projects and other work effortsTrain end users and provide guidance on tool usageFollow and maintain best practices, processes, and techniquesCreate and maintain training documents and knowledge documentation; disseminate these documents to relevant personnelUse, review, and update architecture and application documentationPerform troubleshooting and resolution of production issuesMaintain and administer tools and applicationsMaintain and review design of metadata repositoriesJob Type: ContractPay: $80.00 - $90.00 per hourSchedule:Monday to FridayContract Length:1 yearWork Remotely:Temporarily due to COVID-19","salary":"\n$80 - $90 an hour","date":"Just posted","full_text":"NOT_FOUND"}
{"unique_id":"p_b6663c71b8d0f951","city":"Massachusetts","job_qry":"data","job_title":"Business Analyst (Consultant)","company_name":"Meradia","location":"Boston, MA","link":"https:\/\/www.indeed.com\/viewjob?jk=b6663c71b8d0f951","summary":"Meradia specializes in providing strategic advisory and implementation services to the investment management industry. We help our clients improve their results through a unique combination of technical expertise, experience, and a passionate commitment to our clients’ success.Our consultants’ diverse platform experience, breadth of knowledge, and collective expertise provide the insight needed to help solve client challenges and ensure project success. Since 1997, we have focused on assisting clients in succeeding while building a reputation for surpassing goals and exceeding expectations. From start to finish, your success is more important than our own. Whether starting a new initiative, upgrading an application, or getting your project back on track, we supply the resources, knowledge, and experience to drive change and deliver desired results.Meradia, a leader in Financial consulting and investment software, is seeking a Business Analyst.REQUIREMENTS Analyze business requirements by validating logic, feasibility and testing assumptions and make actionable for development.Provide functional guidance to the client through the successful development and integration of new systems.Provide clients with research and insight relating to software applications and technology, operations processing, reporting, and performance measurement.Develop and maintain project plans, status memos, procedural and operational documentation.SKILLS & ABILITIES Experience designing, developing and implementing technology solutions in the investment services industry.Experience working in or managing systems implementation and development projects that impact multiple departments.Proven record of analyzing business processes and developing practical solutions that drive efficiency, improve client service, and reduce risk.Ability to assess and document business needs: systems, data, integration, workflows, output, and the economic impact of each.Strong analytical and business skills.Excellent interpersonal, verbal, and written communication skills.KNOWLEDGE & EXPERIENCE Strong functional, technical, and operational expertise of the investment management industry.Fundamental knowledge of front, middle, and back-office operations in investment management organization, with a strong understanding of institutional client reporting.Strong knowledge of a broad range of investment management products, including US and global equities, fixed income, and derivative products.Understanding of multi-currency portfolio accounting.Experience writing business requirements, functional requirements and test plans.Basic knowledge of SQL preferred.MBA, CFA charter holder or candidate, CIPM designee, or candidate is strongly preferred.Willingness to travel is required.EDUCATION & EXPERIENCEBachelor’s Degree or equivalent experience. Specialty: Economics, Finance, Accounting, or Management. (Preferred)5+ years of relevant marketing industry experiencePrior experience in Investment Management or Consulting is requiredJob Type: Full-timePay: $61,603.00 - $160,895.00 per yearExperience:business analysis: 5 years (Required)Back Office\/Operations: 5 years (Required)Education:Bachelor's (Required)Work authorization:United States (Required)Required travel:50% (Required)Application Question:Please describe your approach and philosophy to a new project? Please elaborate.Work Location:Multiple locationsCompany's website:www.Meradia.com","salary":"\n$61,603 - $160,895 a year","date":"Just posted","full_text":"NOT_FOUND"}
{"unique_id":"p_144dd3ee3cf31ddc","city":"Massachusetts","job_qry":"data","job_title":"Quality Assurance Field Agent","company_name":"Sales Partnerships","location":"Framingham, MA","link":"https:\/\/www.indeed.com\/viewjob?jk=144dd3ee3cf31ddc","summary":"Sales Partnerships is the most-awarded B2B field sales and marketing outsourcing organization in North America. We partner with respected brands to identify their highest-value opportunities, address their most critical market challenges, and accelerate revenue. Our customized approach combines CRM, GIS, big data analytics, and customer data with tightly controlled processes and highly-trained sales staff. This approach ensures our clients develop deeper market insights and predictable revenue.Our busy, growing sales outsourcing agency is looking for an organized, energetic, and reliable professional to join our amazing team. This is a critical support staff position that will employ a variety of consultative customer service and sales effectiveness techniques to market program initiatives on behalf of our client, a Fortune 100 business, and one of the most respected financial services companies in the world.You will be responsible for promoting our client’s value to small and medium-sized business accounts to ensure brand awareness in a designated territory. You should be comfortable and efficient in territory management, hitting assigned metrics, documentation and reporting, accountability, along with having a strong attention to detail.Apply: Framingham, MA: https:\/\/jobs.lever.co\/salespartnerships\/b0a5da6b-1be5-4b17-a357-bd25b313a4e3Quincy, MA: https:\/\/jobs.lever.co\/salespartnerships\/8db04afd-720a-4c9d-82f9-e73d38273824Worcester, MA: https:\/\/jobs.lever.co\/salespartnerships\/cf6fcbd7-d65b-46c8-b88b-c92294952f5cPhysical Requirements: Access to reliable transportation based on territory requirements. Possess and maintain a valid driver's license. Able to obtain and maintain automobile insurance at or above Company minimum requirements.Working in territory approximately 8 hours each working day. Normal business hours are usually 9am to 5pm, Monday - Friday.Prolonged periods of traveling from business to business in order to conduct in-person meetings. Must be able to travel to businesses within territory and meet with decision makers in person. This typically involves meeting with around 30+ businesses daily.Ability to lift and carry up to 15 pounds at a time.Required Skills\/Abilities: Excellent interpersonal and customer service skillsExcellent organizational skills and attention to detailStrong analytical and problem solving skillsAbility to function well in a high-paced and at times stressful environmentProficient in using Company issued devices (iPhones, iPads) and CRM systems to manage and document daily activitiesAble to effectively present and educate businesses on our client’s brand valueBachelor’s Degree in Business, Marketing, Sales or related field or at least 2+ years related experience strongly preferred.***Please follow the link below to directly apply and one of our recruiters will reach out to schedule an info\/screening call***Apply: Framingham, MA: https:\/\/jobs.lever.co\/salespartnerships\/b0a5da6b-1be5-4b17-a357-bd25b313a4e3Quincy, MA: https:\/\/jobs.lever.co\/salespartnerships\/8db04afd-720a-4c9d-82f9-e73d38273824Worcester, MA: https:\/\/jobs.lever.co\/salespartnerships\/cf6fcbd7-d65b-46c8-b88b-c92294952f5cSales Partnerships is an Equal Opportunity Employer. We respect and seek to empower each individual and support the diverse cultures, perspectives, skills and experiences within our workforce.Job Type: Full-timePay: $80,000.00 per yearBenefits:401(k) matchingDental insuranceHealth insuranceLife insurancePaid time offVision insuranceSchedule:Monday to FridayCOVID-19 considerations:During the COVID-19 pandemic, additional requirements to follow social distancing protocols, hygiene standards and wearing personal protective equipment apply.Work Location:Multiple locationsOn the roadPaid Training:YesManagement:Team LeadTypical start time:9AMTypical end time:5PMCompany's website:https:\/\/www.salespartnerships.com\/Benefit Conditions:Waiting period may applyWork Remotely:No","salary":"\n$80,000 a year","date":"Just posted","full_text":"NOT_FOUND"}
{"unique_id":"p_e45abed728515b4c","city":"Massachusetts","job_qry":"data","job_title":"Shipping Coordinator - Freedom Fertility","company_name":"Cigna","location":"Newbury, MA 01922 (Byfield area)","link":"https:\/\/www.indeed.com\/viewjob?jk=e45abed728515b4c","summary":"Have you heard? Express Scripts and Freedom Fertility Pharmacy are now part of Cigna. Together, we’ve got big plans. How big, you ask? We want to change health care to make it more affordable, more personalized, and more focused on helping the whole person to achieve better health outcomes. And that’s only the beginning.Since 1973 Freedom Fertility Pharmacy has grown to become America's leading fertility pharmacy providing comprehensive patient support around the world. In this role you would coordinate with pharmacists, technicians, and other teams to ensure our patients receive timely accurate delivery of their prescriptions.What you’ll do: Coordinate paperwork, picking, packing, and boxing of prescriptions for shipmentWork closely with the records team for file maintenance and catalogingProvide suggestions on how to continuously improve our processExperience opportunities for cross training and career growthWhat you need to do the job: High School Diploma or GEDStrong work commitment - we work hard to ensure our patients are taken care of so you would be part of a high energy production team that requires a sense of urgency and multi-tasking skillsPositive attitude - we are looking to adopt a new member of the shipping family so enjoying team work mattersMuscles - our prescriptions are often cooled with ice so lifting 35 lb boxes of ice can be your new gym planTech Savvy -data entry skills and not being afraid of technology is importantBe A Strong Communicator - effective interpersonal, written and verbal communication skills are importantBe Efficient - attention to detail, organization, time management, problem solving skills and the ability to work collaboratively with other departmentsFlexibility - be willing to work a flexible scheduleAbout CignaCigna Corporation (NYSE:  CI) is a global health service company dedicated to improving the health, well-being and peace of mind of those we serve. We offer an integrated suite of health services through Cigna, Express Scripts, and our affiliates including medical, dental, behavioral health, pharmacy, vision, supplemental benefits, and other related products. Together, with our 74,000 employees worldwide, we aspire to transform health services, making them more affordable and accessible to millions. Through our unmatched expertise, bold action, fresh ideas and an unwavering commitment to patient-centered care, we are a force of health services innovation.When you work with Cigna, you’ll enjoy meaningful career experiences that enrich people’s lives while working together to make the world a healthier place. What difference will you make? To see our culture in action, search #TeamCigna on Instagram.Qualified applicants will be considered without regard to race, color, age, disability, sex, childbirth (including pregnancy) or related medical conditions including but not limited to lactation, sexual orientation, gender identity or expression, veteran or military status, religion, national origin, ancestry, marital or familial status, genetic information, status with regard to public assistance, citizenship status or any other characteristic protected by applicable equal employment opportunity laws.If you require an accommodation based on your physical or mental disability please email: SeeYourself@ cigna.com. Do not email SeeYourself@ cigna.com for an update on your application or to provide your resume as you will not receive a response.Job Type: Full-timeBenefits:401(k)401(k) MatchingDental InsuranceHealth InsurancePaid Time OffTuition ReimbursementVision InsuranceSchedule:Monday to Friday","salary":"NOT_FOUND","date":"Just posted","full_text":"NOT_FOUND"}
{"unique_id":"pj_f93ad49216c36d84","city":"Massachusetts","job_qry":"data","job_title":"Quality Inspector\/ CMM Programmer","company_name":"TML Manufacturing\/Technimetals","location":"NOT_FOUND","link":"https:\/\/www.indeed.com\/viewjob?jk=f93ad49216c36d84","summary":"CMM Programmer \/ Inspector Job Description Job Responsibilities: Provide CMM programming and operation supporting the quality and manufacturing departments. Maintains quality standards by approving incoming materials, in-process production, and finished products; recording quality results.Job Duties:  Programming and operating CMM equipment; Brown & Sharpe automatic, semi- automatic and Keyence. Control all aspects of inspection equipment calibration. Keeps measurement equipment operating by following operating procedures and work instructions; following calibration due dates. Assist with documentation control through ISO Standards. Inspects incoming and\/or in-process production machined components by confirming specifications; conducting visual and measurement tests; communicating required adjustments to production supervisor\/leader. Conducts First Article Inspections (FAI’s) and documenting results. Documents inspection results by completing reports and logs; completing NCMR’s,CAR’s when required; inputting data into quality database. Maintains safe and healthy work environment by following standards and procedures; complying with legal regulations. Updates job knowledge by participating in educational opportunities; reading technical publications. Accomplishes quality and organization mission by completing related results as needed. Other tasks as assigned.CMM Programmer \/ Inspector Job DescriptionIssue Date: 16-Jan-20Page 1* of 2*Skills and Qualifications: CMM Programming, Analyzing Information, Able to interpret Blueprints\/Drawings, ReportingResults, Documentation Skills, Promoting Process Improvement, Manufacturing Methods andProcedures, Supports Innovation, 3D Modeling, Inspection\/Measurement equipment.Education: Technical (Trade) School Certificate, Associate Degree, Bachelor DegreeReports to: Quality ManagerCMM Programmer \/ Inspector Job DescriptionIssue Date: 16-Jan-20Page 2* of 2*Job Type: Full-timeWork Location:One locationBenefits:Health insuranceDental insuranceRetirement planPaid time offTypical start time:8AMTypical end time:4PMPay Frequency:Bi weekly or Twice monthlyThis Job Is Ideal for Someone Who Is:Dependable -- more reliable than spontaneousAdaptable\/flexible -- enjoys doing work that requires frequent shifts in directionDetail-oriented -- would rather focus on the details of work than the bigger picture","salary":"NOT_FOUND","date":"Just posted","full_text":"NOT_FOUND"}
{"unique_id":"p_037cc4578db867fe","city":"Massachusetts","job_qry":"data","job_title":"Business Analyst","company_name":"RxSense","location":"Boston, MA 02110 (Downtown area)","link":"https:\/\/www.indeed.com\/viewjob?jk=037cc4578db867fe","summary":"Business Analyst, Enterprise Platform Services\n\nJOB SUMMARY:\nRXSENSE is a forward-thinking, growth-oriented healthcare services and technology company that provides state of the art pharmacy solutions. The Business Analyst in the Enterprise Platform Services division will report to the VP of Finance Administration and will be responsible for implementing, maintaining, and managing pricing for clients and pharmacies in RxAgile, the adjudication platform of RxSense. This critical role bridges the technology platform and finance (pricing) and will provide the Business Analyst an opportunity to assist in implementing and managing contract positions for the company.\nPRIMARY JOB DUTIES & RESPONSIBILITIES:\nImplement client and pharmacy pricing in RxAgile as directed by the VP of Finance Administration to include contracted rates and MACs\nMaintain and manage pricing in RxAgile post-implementation of client contracts to ensure contract objectives are achieved\nMaintain and manage pricing in RxAgile for pharmacy contracts to ensure contract compliance objectives are achieved\nCollaborate and coordinate with network management, benefits management, and other departments to build, implement and manage pricing in the adjudication platform for clients and pharmacies\nAnalyze claim activity and produce reporting to show client and pharmacy contract objectives have been achieved\nEnhance and manage QA and claim testing process to ensure contract compliance and objectives\nSupport the annual budget process as needed\nBe a subject matter expert for all things related to RxAgile pricing\nConduct special projects as assigned\n\nDESIRED KNOWLEDGE, SKILLS, & ABILITIES:\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and\/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform these essential functions.\nExcellent working knowledge of pharmacy benefit administration\nProficient ability to own the success of projects with minimal supervision using sound judgment, while maintaining a professional and positive demeanor\nMust be able to develop and maintain strong working relationships on a multi-level basis\nSuperior written and verbal communication skills - ability to communicate information & ideas clearly & concisely\nAbility to foster a positive and creative work environment\nAbility to work in a dynamic fast-paced atmosphere\nAbility to maintain confidentiality\nAbility to work under tight deadlines\n\nEducation and\/or Experience:\nBachelor’s degree, emphasis in Accounting, Finance, Business Administration, or a technology degree with strong work experience related to finance. Technology background with an MBA would be ideal.\nMinimum of 5 years of pharmaceutical distribution and\/or pharmacy benefits industry experience strongly preferred\nStrong business acumen, analytical skills, written and oral communication skills\nHighly proficient in Microsoft; Excel, Word, and PowerPoint\nStrong preference for an individual with data warehouse, SQL, and other data mining experience\n\nPHYSICAL DEMANDS & WORK ENVIRONMENT:\nThe physical demands and work environment characteristics described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\nRegularly required to sit and talk or hear and operate equipment. Frequently required to stand and walk.\nRegularly required to lift and\/or move up to 15 pounds.\nAbility to stand for long periods of time and walk short distances.\nThe noise level in the work environment is moderate. Personal Protective Equipment may be recommended and\/or required in some areas.\nTravel required is less than 15%.","salary":"NOT_FOUND","date":"Just posted","full_text":"NOT_FOUND"}
{"unique_id":"pj_42b310de4665aae2","city":"Massachusetts","job_qry":"data","job_title":"Agent I Contact Center","company_name":"Retail Business Services, LLC","location":"NOT_FOUND","link":"https:\/\/www.indeed.com\/viewjob?jk=42b310de4665aae2","summary":"Retail Business Services, LLC, is the services company of Ahold Delhaize USA, currently providing services to five East Coast grocery brands, including Food Lion, The GIANT Company, Giant Food, Hannaford and Stop & Shop. Retail Business Services leverages the scale of the local brands to drive synergies and provides industry-leading expertise, insights and analytics to local brands to support their strategies with services including Information Technology, Merchandising, Marketing & Sourcing Services, Private Brand Products, Pharmacy Services, Not for Resale, Store Services, Financial Services, Legal Services, Communications, Supply Chain and People Systems and Services. Retail Business Services operates across seven campuses in the Greater Charlotte, Harrisburg, D.C., Portland, Boston and Chicago Areas. For more information, visit www.retailbusinessservices.com. To stay updated with the latest news, follow Retail Business Services on LinkedIn (@Retail-Business-Services) and Twitter (@RBServicesNews).Position Title: Agent I Contact CenterPosition Location: Quincy, MAPosition Summary:The Customer Agent will be responsible for providing direct support to store personnel, as well as customers, in an effort to ensure proper service levels are met on a 7 day x 24 hour basis. Provide excellent customer service to both internal and external customers. Enhance customer loyalty through engagement via phone and email. Provide clear information or direction with regard to actions required by customers (internal and external) in order to fully address their concerns. Provide direct support to store personnel and customers for Technology, Merchandising, Store Maintenance, Operations, Order Add\/Cuts, Order call Block Polling; online orders; digital offers; and loyalty programs.Principle Duties and Responsibilities:> Work with customers and stores to document, resolve and\/or escalate problems being reported. As part of the process, record required contact information and problem description in the appropriate application. Call content, appropriate notifications, error messages, problem classification and severity are critical to the problem review and resolution process.> Strive to provide appropriate resolution at the first point of contact.> Gather data during the problem solving process, analyze the situations, and provide solutions.> Utilize logical problem-solving skills and techniques to troubleshoot and resolve complex problems reported by stores and customers.> Demonstrate excellent writing, grammar, and computer skills in order to meet department standards. Demonstrate empathy and responsiveness to customers’ concerns.> Be alert to urgent or severe issues for immediate escalation, as well as trends that may negatively impact the company.> Take ownership of all calls and cases\/tickets opened; track the contact status to resolution utilizing the appropriate application.> Escalate complex and\/or high priority problems to appropriate coworkers, support groups, or vendors for resolution.> Ensure proper notification and escalation procedures are followed to update business users and customers.> Collaborate with other members of the team to manage calls including, but not limited to: Technology, Merchandising, Store Maintenance, Operations, Order Add\/Cuts, Order call Block Polling issues, Loyalty, Entertaining, and customer concerns.> Support tools\/applications to ensure all steps for error and service recovery have been performed in an effort to resolve reported problems prior to escalating to second level support groups.> Maintain solid documentation of issues as reported inclusive of any recommendations and\/or actions taken. This includes maintaining best practices that will handle the functional requirements for supporting Customer Care, Loyalty, WebCare, Technical, Vendor, and user issues in all stores as well as online.> Receive\/react to contacts from stores and customers> Escalate complex contacts to third level groups> Provide guidance and support to Agent 1 as needed; and when appropriate, assume responsibility for proper handling of said contact> Escalate unresolved issues when appropriate> Add newly provided information to shared document for future reference by the team> Exercise ability to influence other department decisions by providing customer feedback and metrics data (collected from department analyst)> Provide Agent 1 team with necessary training and support to achieve department goals> Monitor contact volume and adjust team responsibilities as needed> Assist Supervisor with scheduling needs> Assist Supervisor with management of team performance> Maintain documentation of processes performed in departmentBasic Requirements:1 - 2 Years of relevant contact center or IT helpdesk experienceBachelor's DegreeJob Type: Full-timePay: $1.00 - $2.00 per hourBenefits:401(k)Dental InsuranceHealth InsuranceLife InsurancePaid Time OffVision InsuranceSchedule:Monday to FridayExperience:Call Center: 1 year (Preferred)","salary":"NOT_FOUND","date":"Just posted","full_text":"NOT_FOUND"}
{"unique_id":"p_2806224868cefb98","city":"Massachusetts","job_qry":"data","job_title":"Cash Receipts\/Collections Coordinator","company_name":"South Shore Health","location":"Weymouth, MA 02190 (South Weymouth area)","link":"https:\/\/www.indeed.com\/viewjob?jk=2806224868cefb98","summary":"Requisition Number: 64587\n\nFacility: LOC0001 - 55 Fogg Road55 Fogg Road\nWeymouth, MA 02190\n\nDepartment Name: VNA Patient Accounts\n\nStatus: Full time\n\nBudgeted Hours: 40\n\nShift: Day (United States of America)\n\nUnder the supervision of the Collections\/Insurance Authorization Supervisor, is responsible for cash receipts and collections being processed in a timely manner, as directed by Supervisor. Also performs various clerical duties, computer adjustments and maintaining logs and spreadsheets for the Auditors.\nESSENTIAL FUNCTIONS\n\nEssential functions are those tasks, duties and responsibilities that comprise the means of accomplishing the job's purpose and objectives. Essential functions are critical or fundamental to the performance of the job. They are the major functions that the person in the job is held accountable for. Following are the essential functions of the job.\n\n\nUse this to denote if a function does not provide opportunity to perform beyond \"Meets Expectations\"\n\n1. Under the supervision of the Collections\/Insurance Authorization Supervisor, performs various clerical duties pertaining to Cash Receipts and Collections.\n\n2. Breakdown of daily deposit and disbursing to HHR and Hospice with appropriate documentation.\na. Copying all checks for VNA, Petty Cash duties and sending donation checks to Foundation Department.\n\n3. Daily cash receipts applications are entered into the computer and confirm that cash entries balance with the daily deposit via batches. Notes in comment section of cash application on services paid incorrectly or denied.\n\na. Downloading of Harvard Pilgrim Remits\n\nb. Downloading of MassHealth List for A\/R\n\n4. Investigates and researches credits on accounts determining whether overpays or computer errors and adjusts accounts accordingly.\na. Sends letter to appropriate insurance companies to notify them of overpayment.\n\nb. When invoice is received from insurance company, request check from Accounts Payable for refund.\n\nc. Make necessary adjustment in the computer of the refund.\n\n5. Forwards required cash information to South Shore Health & Educational Corporation Accounting Department monthly and deals with South Shore Hospital - Finance Department on any questions or problems pertaining to cash.\na. Enter all deposit totals on Excel spreadsheets in shared directory between Finance Department and Accounts Receivable.\n\nb. Forward required cash information to Finance Department monthly. Communicate with Finance Department on cash related issues till resolution has been reached.\n\nc. Detail Medicare Figures since payment is daily.\n\n6. Enters monthly write–offs in the computer software (free care, allowance).\n\n7. Accounts Receivable\/Collections tracking which include follow up on claims for appeals, reconciliation of accounts due to rate issues, authorizations, denials, timely filings, coding problems, whether current or past due – working closely with supervisor regarding these issues and calling the respective insurance company (non-government payors) regarding these issues.\na. Works closely with the Insurance Liaisons to resolve authorization denials.\n\n8. Resolving any patient issues that may arise through inquiries regarding insurance payments not processed correctly. Document in computer software system all conversations with patients, clinical staff, or insurance carriers in comment section of system.\n\n9. Updates Aging Report notes.\n\n10. Basic knowledge of operations within the Insurance Department for emergency backup should the need arise.\n11. Weekly reporting to supervisor of denied claims and current status.\n\n12. Works with the AR department to resolve payor changes as related to patient billing.\n\n13. Performs other duties as required and assigned.\n\n14. Maintains confidentiality of all information\/data utilized and does not discuss same outside the realm of job responsibilities.\n\nESSENTIAL FUNCTIONS (Cont.)\n\nI. Technology and Learning\na. Participates in continued learning and possess a willingness and ability to learn and utilize new technology and procedures that continue to develop in their role and throughout the organization.\n\nb. Embraces technological advances that allow us to communicate information effectively and efficiently based on role.\n\nNON-ESSENTIAL FUNCTIONS\n\nNon-essential functions are those tasks, duties and responsibilities that are not critical to the performance of the job. Following are non-essential functions of the job, along with the corresponding performance standards.\n\n1. Other duties as required.\n\nTraining or experience with PC spreadsheet software desirable. Experience in Cash Receipts, Credits and Collections. Prior experience in VNA environment.\n\nResponsibilities if Required:\nEducation if Required:\nLicense\/Registration\/Certification Requirements:","salary":"NOT_FOUND","date":"Just posted","full_text":"NOT_FOUND"}
{"unique_id":"p_2f422eee572b9ab9","city":"Massachusetts","job_qry":"data","job_title":"Senior Assessor Analyst","company_name":"City of Springfield, MA","location":"Springfield, MA","link":"https:\/\/www.indeed.com\/viewjob?jk=2f422eee572b9ab9","summary":"Position Purpose\/Summary\nResponsible for analyzing and maintaining complete, accurate, and current land and building records in compliance with data standards and practices and in support of property valuations and the tax levy. Responsible for ensuring the accuracy and uniformity of information within and across the valuation software, Geographic Information System, tax billing and collection programs and all files essential to department operations. Work is performed in accordance with accepted practices, laws, regulations, and ordinances with review by the Chairman of the Board of Assessors. Some direct supervision is exercised over staff.\n\nEssential Functions\nResponsible for the process of examining and interpreting recorded deeds and plans and for changing assessing and billing records to reflect land parcel changes and ownership and address changes.\nObtains appropriate records such as deeds and maps for alteration of land dimensions of parcels, i.e. metes and bounds.\nProvides records to Public Works engineers to enable the alteration of parcels on the Geographic Information System (GIS).\nResponsible for the timely maintenance of land and building data on the valuation software and ensuring the data conforms to the data definitions and standards of uniformity and accuracy.\nProvides support to the annual collection of property income and expense data.\nProvides support to the cyclical inspection process such as preparing files and printing letters.\nResponsible for the process of determining whether property sales qualify as valid market sales for inclusion in the development of valuations, and for the entry of codes in iasWorld.\nAssists the board in the preparation of the official property sales file for submittal to the Massachusetts Department of Revenue (MDOR) annually.\nDevelops, maintains, and prepares data files to ensure compliance with the Massachusetts Department of Revenue (DOR) requirements for documentation of tax base growth and other assessing standards in the tax rate process.\nPrepares official warrants for preliminary and final tax commitments.\nResponsible for maintaining accurate files of applications and forms pertaining to exemptions to properties owned by qualifying organizations.\nResponsible for the statutory personal exemption program pertaining to senior citizens, surviving spouses, veterans, blind, and others. Assists taxpayers, prepares applications and supporting materials for board consideration, enters amounts on billing file, sends notices of decision to taxpayers, prepares DOR reimbursement forms.\nResponsible for the overvalue abatement process, preparing materials for the board, calculating abatements and posting timely and accurately on the billing records, causing the sending of notices of decision\nMaintains accurate and current accounting of abatements and exemptions in the overlay reserve account\nResponsible for recording tax title documents and changing taxable status of properties.\nResponsible for monitoring compliance of properties subject to alternative revenue programs such as Chapter 121A projects and organizations making payments-in-lieu-of –taxes.\nPrepares analytical and statistical reports as requested by the Chairman.\nOversees the fiscal activities of the department, including accounts receivable and payable, requisitions, purchase orders, procurement and contracts, etc.\nGenerates Abutters lists for special permits and zone changes. Updates new parcels and prints maps. Runs queries.\nGenerates regular abatement total reports for Comptrollers. Creates new, omitted and revised tax bills, etc.\nProvides customer service on the telephone, regular and electronic mail, and at the public counter.\nProvides assistance with fulfilling public records requests as needed.\nAssists with personal property data entry for value and billing purposes and with customers and other staff regarding abatement activities as needed\nAssists with Motor vehicle excise billing and abatements as needed\nPerforms related work as required.\nKnowledge, Skills, and Abilities\nGeneral knowledge of the principles, methods and techniques of real property valuation.\nDetailed knowledge of the creation, interpretation, and maintenance of real estate records, documents, and maps, etc. Assessor's Office.\nGeneral knowledge of laws, rules and regulations governing real estate tax billing and assessments.\nGeneral knowledge of local real estate values and trends.\nAbility to assemble, develop, analyze, and evaluate data regarding real estate\nAbility to establish and maintain effective working relationships with officials and the general public.\nAbility to express oneself clearly and concisely, both orally and in writing.\nEducation and Experience\nBachelor's degree with course work in public or business administration, economics, mathematics, information technology.\nMinimum of three years of experience in real estate, law, finance, banking, insurance or other employment relevant to functions and operations of the Assessor's Office.","salary":"\n$54,912 a year","date":"Just posted","full_text":"NOT_FOUND"}
{"unique_id":"pj_eaeda82024fe12c3","city":"Massachusetts","job_qry":"data","job_title":"Warehouse Associate- 2nd shift\/Sunday-Thursday","company_name":"Owens and Minor","location":"NOT_FOUND","link":"https:\/\/www.indeed.com\/viewjob?jk=eaeda82024fe12c3","summary":"WAREHOUSE COORDINATOR -Take the first step toward a career in the healthcare industry!Shift: 2nd shift, Sunday-Thursday; Sunday 7am start time, M-TH 3pm start timeCompensation: $16.00 hourly plus 8% shift differentialCore Job Responsibilities:You will be responsible for ensuring that all warehouse functions are completed accurately and on timeEnsuring the accuracy of all shipping\/receiving documents and maintaining all records relative to shipping\/receiving activitiesAssuring that shipping\/receiving counts match picking\/purchase order documents and assisting in resolving any discrepanciesPicking orders to be shipped, ensure proper labels and paperwork have been applied before shippingVerifying (recounting) orders received by others to ensure accuracy of incoming merchandiseUtilizing material handling equipment, safely and efficiently, to transport product to shipping locations or delivery platforms and ensuring orders are staged in order of deliveryQualifying Experience:General knowledge of math, reading, basic accounting, typing, etc.Prior experience working in a distribution center a plusAble to work in a fast paced, team environmentMust be willing to learn how to use new equipment WMS TechnologyMust adhere to all safety rules and requirementsMust be available to work all overtime hoursTeammates will need to provide their own protective footwearJob Type: Full-timePay: $16.00 per hourBenefits:401(k)401(k) matchingDental insuranceDisability insuranceEmployee assistance programEmployee discountFlexible spending accountHealth insuranceLife insurancePaid time offProfessional development assistanceReferral programRetirement planTuition reimbursementVision insuranceSchedule:8 hour shiftOvertimeCOVID-19 considerations:The safety of our teams is our top priority. We have implemented several safety measures that are practiced every day: mandatory temperature screenings, company provided masks and gloves, hand sanitizer stations & social distancing initiatives.Experience:Pallet Jack: 1 year (Preferred)Cherry Picker: 1 year (Preferred)Forklift: 1 year (Preferred)Warehouse: 1 year (Preferred)Work Location:One locationWarehouse Skills:Forklift experienceData entryPackagingPallet jackThis Job Is Ideal for Someone Who Is:Dependable -- more reliable than spontaneousAdaptable\/flexible -- enjoys doing work that requires frequent shifts in directionDetail-oriented -- would rather focus on the details of work than the bigger pictureCompany's website:www.owens-minor.comCompany's Facebook page:https:\/\/www.facebook.com\/owensandminor\/Work Remotely:No","salary":"\n$16 an hour","date":"Just posted","full_text":"NOT_FOUND"}
{"unique_id":"p_e14332e2fcee0d39","city":"Massachusetts","job_qry":"data","job_title":"Vice President of Strategies and Innovation","company_name":"Jenzabar","location":"Boston, MA 02199 (Back Bay area)","link":"https:\/\/www.indeed.com\/viewjob?jk=e14332e2fcee0d39","summary":"Summary\n\nResponsible for formulating and overseeing the development and execution of Jenzabar's (\"the company\") short and long-range strategic goals, financial objectives and related plans. Responsible for translating strategic business goals into operational plans and tactics to achieve strategic\/financial goals.\n\nResponsible for driving strategic technology innovation for continued company\/ business growth. Works in partnerships with key business leaders to prepare the company for the future; fosters and facilitates strategic thinking on innovative product initiatives.\n\nDefines and drives the product management strategy and business plan, short- and long-term growth strategy and positioning of the company's products in the market.\n\nResponsible for researching and developing effective and financially productive business partners.\n\nResponsibilities\n\nCORPORATE STRATEGY & PLANNING\n\nDevelop long-term, forward-thinking business strategies designed to keep the company ahead of competitors. Create\/generate strategic opportunities to expand revenue both organically and opportunistically (EG: M&A; business licensing, etc.). Lead the implementation of these strategic opportunities.\nResearch\/analyze future technological developments and changes in the marketplace to ensure Company is well positioned to take advantage of both; identify new markets and sources of potential growth; recommend new approaches to maintain Company's competitive edge. Responsible for the analysis of trends and developments in technology and for formulating strategic courses of action to maximize the Company's leverage within its market.\nDevelops market awareness, industry insights, and trend identification to provide strategic direction to the company. Gathers of market data, conducts vendor review and analysis, attends industry events, to development strategic relationships. Develops a process to disseminate insights throughout the organization.\nResponsible for analysis of business outcomes as they relate to products and services required \/anticipated by the market. Partners with product development\/engineering, operations, and service\/support leaders to ensure expected business outcomes.\n\nTECHNOLOGY INNOVATION\n\nLooks for ways to introduce new, innovative opportunities, from concept to market readiness.\nLeads the financial evaluation of potential business\/growth opportunities.\nBuilds effective cross-departmental partnerships to foster innovation throughout the company.\nLeads Jenzabar's strategic technology direction in order to deliver on innovative product initiatives, improving product management processes and support of managed products in market.\n\nPRODUCT MANAGEMENT STRATEGY\n\nDefines and oversees the product management strategy; roadmap and lifecycle of the company's product portfolio. Directs the end-to-end leadership of new and existing products from inception through all phases of the products' lifecycle.\nEnsure products meet the evolving needs of our customers and prospects. Recommend changes to existing approaches, product design, and product mix to maximize our market potential.\nChampions market analysis activities – market segmentation, research, forecasting, and market access\nDrive alignment across the organization.\nEnsures product initiatives are resourced and delivered in a timely, customer-embraced manner.\n\nPARTNERS\n\nResponsible for researching and developing effective, financially sound business partners to augment and expand company offerings.\nQualifications\nDegree in Business Administration; MBA preferred.\nMinimum of 10+ years of operational experience, including proven operational success in higher education and technology sectors.\nExcellent communication and presentation skills, both written and oral, as well as excellent listening skills.\nExcellent leadership skills, including the ability to develop trust and credibility, lead by example, and motivate high-performing teams.\nExcellent management skills, including the ability to supervise multiple disparate teams and develop talent.\nAbility to effectively manage multiple priorities in a complex environment.\nFluent in Finance matters including experience owning P&L and driving decisions around spend.","salary":"NOT_FOUND","date":"Just posted","full_text":"NOT_FOUND"}
{"unique_id":"p_72b0d0ebed5053b1","city":"Massachusetts","job_qry":"data","job_title":"Preclinical Study Coordinator","company_name":"Wave Life Sciences","location":"Lexington, MA 02421","link":"https:\/\/www.indeed.com\/viewjob?jk=72b0d0ebed5053b1","summary":"Wave Life Sciences is a biotechnology company focused on delivering transformational therapies for patients with serious, genetically defined diseases. We differentiate ourselves through our proprietary chemistry platform that enables the production of stereopure oligonucleotides that precisely target the underlying cause of rare diseases. At Wave, we welcome those who share a passion to change lives and embrace a culture that is thoughtful, dynamic, humble, and fearless. Together, we can contribute to our mission enabling every patient with a genetic disease to have access to life changing treatments.\nScope:\nWave Life Sciences USA seeks an experienced and highly motivated individual to join our team in Lexington, Massachusetts. The selected individual will support multiple preclinical programs and be responsible for sourcing and managing nonGLP and GLP preclinical toxicology and pharmacokinetic studies by proactively maintaining effective cross-functional communication and study monitoring to ensure timely delivery of high-quality study reports from various external vendors. This individual will act as the liaison between Wave Internal functional Groups and Contract Research Organizations (CRO) to confirm and track deliverables of collected samples, documentation, data, and reports to ensure internal and external alignment and proper coordination of preclinical studies.\nResponsibilities:\n\nCollaborate closely with Wave toxicologists, study sub-teams (internal\/external) and Contract Research Organization (CRO) partners\nAlign with program toxicologists on the design and timing of studies needed to support key clinical milestones\nCollaborate with program toxicologists to manage and chair cross-functional pre-clinical sub-teams for assigned programs in order to enable efficient communication between pre-clinical sub-teams and program teams\nWork closely with relevant Wave colleagues and CROs to coordinate and track all study-related documentation, specimen shipment, reporting timelines and archiving by maintaining appropriate file management and document control for assigned programs including timely delivery of final reports and SEND datasets\nTravel to contract labs to monitor procedures on active studies as needed (as coordinated with program toxicologists). Write detailed CRO monitoring reports\nMaintain study tracking tools and study calendar\nSupport implementation and management of nonclinical toxicology projects through file management and document control\nSupport financial aspect of preclinical development studies via contract processing, purchase order generation, processing of timely\/accurate invoice payments and support for budget forecasting\nObtain cost estimates and Statements of Work for individual studies or programs from CROs and schedule studies to meet program timelines\nParticipate in new CRO qualification and re-qualification of established partners as requested to ensure the highest quality studies are compliant with all regulatory standards\nParticipate in discussions and resolution meetings with CROS as they arise\nStay current on CRO industry news and changes to business models\nEducation \/ Experience:\nB.S. \/ M.S. or equivalent in biology, biochemistry, toxicology or a related field\n5 or more years of experience in a biopharmaceutical company\nExperience as a Study Monitor\/Project Manager in a preclinical toxicology group is essential\nDemonstrated understanding of GLP and regulatory requirements for the conduct on toxicology studies\nSkills \/ Pre-requisites:\nExcellent communication and interpersonal skills\nSuperior understanding of Microsoft Office products\nAptitude for organizational detail, change agility and ability to manage multiple projects concurrently\nCapacity to complete tasks independently in a highly-regulated environment\nFlexibility to function well within a team environment and within condensed timelines\nAbility to verbalize complex study issues and demonstrated problem-solving ability\nDocumented knowledge of regulatory requirements and good laboratory practices (GLP)","salary":"NOT_FOUND","date":"Just posted","full_text":"NOT_FOUND"}
{"unique_id":"p_c2a16b1c85001d79","city":"Massachusetts","job_qry":"data","job_title":"Lead Business Systems Analyst","company_name":"SRI INFOTECH","location":"Orange, MA","link":"https:\/\/www.indeed.com\/viewjob?jk=c2a16b1c85001d79","summary":"Job ResponsibilitiesThe IDEAL candidate will have very strong experience in derivatives Analyze business and engineering and data processing problems to improve computer systems and implement solutionsExamine user requirements, procedures and problems to improve existing systems and automation while reviewing and analyzing technical reports, manuals, periodicals and other reference materials to develop programs to meet needsReview existing computer systems to understand capabilities, scheduling and workflow limitations, and make recommendations, including upgrading to and purchasing new equipment or software packagesDocument, develop and revise system design procedures, test procedures and quality standardsMaintain, test and monitor computer systems and programs while coordinating installations of new programs and systemsAssist staff in resolving computer-related problems, such as programming errors and malfunctions, and train users on computer programs and systemsConsult with management to reach agreement on system operating principles, and work with clients on information computation or processing needs to be addressedSupervise computer programmers or systems analysts by taking on project management lead roles in systems projectsJob Types: Full-time, TemporaryPay: $60,543.00 - $170,285.00 per yearExperience:Collateral Development: 4 years (Required)Swift: 4 years (Required)SQL: 4 years (Required)Derivatives: 4 years (Required)Application Question:Seeking a sponsor for H1-B Visa Transfer?Work Location:One locationWork Remotely:Temporarily due to COVID-19","salary":"\n$60,543 - $170,285 a year","date":"Just posted","full_text":"NOT_FOUND"}
{"unique_id":"p_1ea54d9214c0fe60","city":"Massachusetts","job_qry":"data","job_title":"VP, Customer Success","company_name":"Logz.io","location":"Boston, MA","link":"https:\/\/www.indeed.com\/viewjob?jk=1ea54d9214c0fe60","summary":"About Logz.io\nThe successful candidate will execute a vision and playbook working alongside Sales in the sales cycle and customer on-boarding through tech assistance, renewal and revenue expansion while positioning Logz.io’s Customer Success organization as a competitive advantage.\nDrive Customer Success Outcomes:\nDelight customers and empower them to succeed and grow using the Logz.io platform\nDrive processes to enable our customers to drive deeper and meaningful adoption of the platform\nLead a world-class Customer Success organization spanning Customer Success Engineering and Account Management in the US and EMEA.\nDrive customer effective retention rate through structured programs that focus on increasing account revenues through expansion programs, contract renewal rates and minimizing churn.\nDrive new business growth through greater advocacy and reference-ability from the current customer base.\nDefine and Optimize the Customer Lifecycle:\nInfluence future lifetime value through higher\/deeper product adoption, customer satisfaction, NPS, and overall health scores. This includes definition and optimization of the customer lifecycle.\nDevelop strategic initiatives that align to the customer journey map and drive customer satisfaction, retention, and advocacy.\nMaintain a deep understanding of Logz.io’s customers, product offerings, product use cases and best practices.\nLead a World-Class Customer Success Team\nDesign and implement on-boarding process for new team members.\nFoster collaboration and a shared culture within your teams, across the Customer Success and other departments, and across the customer lifecycle.\nEncourage continuous learning within the team.\nMeasure Effectiveness\nRead and analyze data and report customer status regularly, including customer satisfaction and\/or risk, project status and\/or risk, account plans and other information.\nCreate reporting and dashboards to measure results against KPI targets, along with the associated cadence.\nEmbed Customer Success Across the Company:\nDrive proactive, cross-functional alignment and collaboration across the business including Sales, Marketing, Product and Engineering organizations.\nBe the primary advocate for our customers, representing both the voice of the customer and the company, and balancing the needs of the customer with those of the business.\nServe as a key stakeholder by providing input and investment recommendations to the product roadmap based on internal and customer needs and experiences.\nPartner with Marketing on CS enablement, customer marketing, and voice of the customer programs.\nServe as the customer advocate by creating a feedback loop on customer issues, escalations, and needs with appropriate internal teams.\nRequirements:\nExtensive experience (10+ years) leading a fast-pace SaaS-based customer organization with a proven playbook and demonstrated results in driving customer outcomes and revenue.\nStrong empathy for customers and understanding of value drivers in recurring revenue business models.\nHigh impact leadership skills, including setting a clear vision and strategy, motivating and coaching others, driving urgency and results.\nExperience leading success of a highly technical product\nExperience in the DevOps\/Developer space - Advantage\nDeep go-to-market knowledge and experience implementing and measuring operational metrics, leveraging data to identify trends in customer satisfaction and retention risk.\nExceptional business acumen and world-class presentation and customer interaction skills.\nAbility to respond to high-impact customer\/product escalations in a way that drives customer loyalty including the ability to listen and speak clearly to customers.\nAnalytical and process-oriented mindset.\nLeads by example – demonstrating curiosity, empathy, grace under pressure, integrity, responsiveness, transparency, agility and authenticity.\nProven ability to lead and grow CS professionals and teams, build successors and improve capabilities.\nExperience working for a growth stage startup company","salary":"NOT_FOUND","date":"Just posted","full_text":"NOT_FOUND"}
{"unique_id":"p_cdebee0c74d73562","city":"Massachusetts","job_qry":"data","job_title":"HCM Implementation Specialist- Remote","company_name":"MassPay","location":"Beverly, MA 01915","link":"https:\/\/www.indeed.com\/viewjob?jk=cdebee0c74d73562","summary":"We are currently looking for a detail oriented, customer focused HCM Implementation Specialist. This role is responsible for assisting our customers with the design and implementation of their MassPay iSolved solution. It serves as a functional expert and leads the customer in the build, testing and implementation of their SaaS software solution, with a primary focus on HR, time and attendance and payroll business processes. Since this position is the first point of contact with the client post sale and has the most frequent contact with the client during implementation, this person must provide exceptional, seamless service for the clients and their needs.\nWhat you will do:\nLeads new customers through iSolved implementations, ensuring the customer’s employee data, payroll, time and attendance and HR business processes are configured accurately.\nManages project plans to ensure project deliverables and customer launch dates are met.\nPartners with other MassPay teams to ensure all customer needs are delivered through an integrated implementation approach.\nMonitors the implementation process for potential issues and escalates issues as needed to ensure the customer’s needs are met and the implementation process schedule is maintained.\nPrepares customers for post-implementation self-sufficiency by delivering iSolved system training as part of the Implementation process.\nContributes to the evolution and improvement of the Payroll Implementation process by providing feedback and sharing ideas that will increase customer satisfaction, drive efficiency or enhance our technical capability.\nBuilds solution, customer and industry knowledge by leveraging the appropriate internal and external resources.\nAdheres to company and departmental policies.\nProvide pre-sales support to sales team as necessary.\nCross trains on all Isolved services.\nProvides training to new and current clients. Provides recommendations to clients as to how they can best use Isolved.\nProvide weekly reporting as required by manager\nWho you are:\nBachelor’s college degree or equivalent education\/business experience.\n1-3 years of experience in delivering payroll services, including payroll tax, with strong business process knowledge related to payroll services.\nSoftware implementation experience, preferably in a SaaS environment.\nStrong technical aptitude and capabilities.\nPassion for delivering exceptional customer service and problem solving skills.\nStrong attention to detail and time management skills, including the ability to manage multiple projects at one time.\nExcellent written and verbal communication skills.\nWho we are:\nMassPay provides businesses with a cloud-based Human Capital Management (HCM) solution to automate their HR & Payroll processes, maintain in-depth employee data, administer benefits, provide electronic onboarding for new hires, capture employee time & attendance and much more. This technology solution, combined with MassPay’s HR Services, improves the employee experience, keeps businesses in compliance, and helps managers and supervisors to become better employers.\n\nMassPay has grown rapidly since it was founded in 2004, providing a superior product and building a reputation for personalized, responsive service. The company has a strong culture built from empowered and growth-oriented team members. The company offers a terrific benefits package including fun perks such as Wednesday lunches, Friday happy hours, company events\/trips, and community service opportunities. MassPay has been named to the BBJ’s Pacesetters\/Fast50 list of the fastest growing private companies in Massachusetts for five consecutive years as well as named on the Inc. 5000 list of increasing year over year revenue growth for four consecutive years, (only 10% of privately owned companies in the U.S. have achieve that feat). MassPay is also proud to be the 2017 Gold Stevie Winner for Customer Service and Client Support Team of The Year.\nPowered by JazzHR\nQsnh3k88ca","salary":"NOT_FOUND","date":"Just posted","full_text":"NOT_FOUND"}
{"unique_id":"p_a7d798d74f83a7c9","city":"Massachusetts","job_qry":"data","job_title":"Customer Account Analyst","company_name":"Corbus","location":"Lynn, MA 01901","link":"https:\/\/www.indeed.com\/viewjob?jk=a7d798d74f83a7c9","summary":"Corbus is seeking a Customer Account Analyst to support a world-leading provider of commercial and military jet engines and components, as well as avionics, electric power, and mechanical systems.\n\nResponsibilities Include but are not limited to:\n\nCoordinate with client resources to ensure timely shipment of material required to support international and domestic military customer requirements.\n\n\nInterface with all levels of supply chain to assure adequate material support.\n\n\nExpedite and prioritize critical shortage items in support of customers.\n\n\nCoordinate work flows requiring pull in\/push out to support both material and inventory goals.\n\n\nInterface with receiving, pack shop, quality and traffic to ensure timely processing, packing and shipment of material to support customer requirements.\n\n\nManage all customer orders from order entry through to delivery, coordinating efforts through Customer Account Manager, Order Entry, forecaster, planner and other as required.\n\n\nParticipate in or lead daily critical meetings as required to support the programs.\n\n\nMaintain folders required to document transactional detail including Purchase requisitions and Quotations.\n\n\nMonitor and control customer and OEM inventory levels, fleet and depot requisitions, and monthly consumption data for the customer\n\n\nForecast future (long cycle) material requirements based on customer requirements\n\n\nCommunicate critical customer issues and program needs by escalating to Customer Account Manager.\n\n\nPreferred Qualifications:\n\n4 yr. college degree\nExcellent communication skills\nStrong knowledge of Microsoft suite of products (including in depth knowledge and experience with Excel)\nOrganizational skills\nSense of urgency to provide excellence in customer service.\nAdditionally, experience in GE-Specific Databases is desired, and critical to the performance of these services: Military AMPS, Salesforce, Haystack, Customer Web Center, Workflow Tool, Shared Folders, Libraries, COGNOS, Supply Chain Web Center, Digital Workbench, Customer Quality Event, Spotfire.\nStrong knowledge of Microsoft suite of products\nStrong presentation skills\nExperience at working with project teams","salary":"NOT_FOUND","date":"Just posted","full_text":"NOT_FOUND"}