[{"unique_id":"pj_187f210680fa7433","city":"Massachusetts","job_qry":"data","job_title":"Product Manager, Oncology Data Services","company_name":"Perthera","location":"NOT_FOUND","link":"https:\/\/www.indeed.com\/viewjob?jk=187f210680fa7433","summary":"Perthera is a Healthcare Bioinformatics company that delivers a leading-edge Precision Oncology Platform with Artificial Intelligence (AI); benefiting hospitals, physicians, BioPharma and patients with cancer. This medical startup, located in Holliston, MA, is in need of an upstream Product Manager to help develop and launch Perthera’s Precision Oncology Platform worldwide. Initially remote, due to Covid-19, this position will eventually report to the corporate office in Holliston, MA.Position The Product Manager, Oncology Data Services is responsible for:· planning, organizing, and managing the Precision Oncology AI product lines from conceptual stages through product life cycles to optimize profit and meet marketing, financial, and corporate growth objectives;· understanding customers’ clinical and strategic problems to envision and develop highly usable customer solutions;· creating and implementing market development strategies to target key customers;· developing clinical expertise and leveraging that knowledge to educate the organization and build relationships with existing and new customers and· developing and executing a comprehensive launch plan and strategy for new products.Responsibilities · Perform product management and manage product life cycle· Provide short term and long-term sales forecasts for presentation to senior management· Develop product branding road map based on customer analysis, market analysis, competitive analysis, and Perthera’s core competence· Lead customer-facing tasks for new product development - from front end to launch· Acquire and analyze feedback from KOLs, current and potential customers, third party market research and internal stakeholders· Work with MarComm for web content, outbound campaigns, educational seminars and workshops, and digital and print marketing collateral· Serve as an internal subject matter expert in one or more health domain areas· Work with development, implementation, testing, support, sales, and field engineering team members to bring new features and products to successful release· Represent the “voice of the customer” internally, using healthcare domain experience in guiding product design and development· Participate in the Healthcare Bioinformatics professional community and in national and international conferences· Develop technique guides, product literature, brochures, sales binders and all sales support information· Work with Clinical Ops, Bioinformatics, and Sales & Marketing to identify clinical research topics for each product· Plan, organize and execute courses and symposia for specific product introductions in conjunction with sales and clinical R&D· Participate in management meetings on strategic initiatives and business planning· Ensure compliance with applicable governmental laws, rules, and regulations, both in the United States and internationally, by completing introductory and annual training and maintaining knowledge of compliance as it applies to your role· Special projects and duties as assignedQualificationsMore than 3 years’ experience in Product Development and\/or Marketing in a fast-paced environmentDemonstrated domain expertise with a clear understanding of healthcare workflows and practical use of informationPrevious experience working in healthcare product development at an in-depth level, in industry or with a provider organization preferredExcellent written and verbal communication skillsAbility to work directly in both team and individual settings, including working directly with customersWorking knowledge of Microsoft Office, Google Analytics, and CRM systemsWell organized, detail oriented, and team player capable of working in a deadline dictated environmentUndergraduate degree requiredFurther Details: · Full-time Role· Start date: Immediate· Total compensation up to $110,000 annually (including discretionary variable compensation) with benefits, depending on experienceJob Type: Full-timePay: $75,000.00 - $85,000.00 per yearBenefits:401(k)Dental insuranceHealth insurancePaid time offVision insuranceSchedule:Monday to FridaySupplemental Pay:Bonus payCOVID-19 considerations:This position will initially be remote. Any in-office interviews or meetings will observe all social distancing and safe practices guidelines from the State of Massachusetts and the CDC.Experience:Product Marketing: 3 years (Required)Location:Holliston, MA 01746 (Required)Work Location:Multiple locationsVisa Sponsorship Potentially Available:No: Not providing sponsorship for this jobThis Job Is Ideal for Someone Who Is:Adaptable\/flexible -- enjoys doing work that requires frequent shifts in directionAchievement-oriented -- enjoys taking on challenges, even if they might failInnovative -- prefers working in unconventional ways or on tasks that require creativityCompany's website:www.perthera.comCompany's Facebook page:https:\/\/www.facebook.com\/pertheraWork Remotely:Temporarily due to COVID-19","salary":"\n$75,000 - $85,000 a year","date":"Just posted","full_text":"NOT_FOUND"},{"unique_id":"pj_1da64008e9606ed5","city":"Massachusetts","job_qry":"data","job_title":"Treasury Analyst","company_name":"Cambridge Savings Bank","location":"NOT_FOUND","link":"https:\/\/www.indeed.com\/viewjob?jk=1da64008e9606ed5","summary":"POSITION: TREASURY ANALYST\nSummary:\nResponsible for various operational, reporting and analytical functions related to liquidity management, cash-flow modeling and financial reporting. This individual plays an active role in supporting the Bank’s Treasury department.\n Key Result Areas:\nProvide primary support for efficient cash management and investment settlements by administering daily management of the Bank’s liquidity position, monitoring daily cash flows, and gauging excess\/deficit in funding requirements\nAssist with calculations to Sell\/and or purchase excess\/deficit funds daily with network of financial counterparties\nMonitor safekeeping and custodial activity for Bank’s investment portfolio, assisting the accounting group by researching non-reconciled discrepancies between Bank’s accounting records and custodian banks\nAssist with updating the interest rate risk model (within BASIS) by assembling and analyzing all actual data inputs; including general ledger data, warehouse data, loan, deposit and investment information and market data\nCollect and maintain historic interest rates, economic indicators and other market data from various sources, including Bloomberg\nProduce comprehensive reporting materials for Liquidity (Daily) and Asset Liability Management (Monthly), meeting strict deadlines\nRecord meeting minutes for monthly ALCO meetings\nProvide adhoc modeling and analysis as needed in support of specific but widely varying strategic initiatives. This would include modeling deposit pricing on new and existing products and modeling impact of various growth strategies on income and interest rate risk\nAssist in administration of Swap program by providing documentation, both pre-trade and post-trade as well as work with lenders, underwriters, closing attorneys, servicing department, and other counterparties\nEstablish and maintain effective working relationships with other employees and customers\nContribute to the effective team management of all Bank problems, issues and opportunities\nPerform additional duties as required\nQualifications:\nBS degree, preferably in finance or economics\nMinimum 1 to 2 years of banking experience\nWorking knowledge of banking industry\nStrong analytical and communication skills.\nAbility to work independently with minimal supervision\nEffective time-management skills and comfortable meeting strict deadlines\nThe above description covers the most significant responsibilities but does not exclude other occasional responsibilities and accountabilities, the inclusion of which would be in conformity with the major purpose of this job.\nLocation:\nWaltham, Massachusetts\nAbout Cambridge Savings Bank:\nCambridge Savings Bank is a full-service financial institution with approximately $5 billion in assets that is committed to improving the quality of life in the communities it serves. One of the oldest and largest community banks in Massachusetts, Cambridge Savings Bank offers a full line of individual and business banking services and has branches located in Arlington, Bedford, Belmont, Burlington, Cambridge, Charlestown, Concord, Lexington, Melrose, Newton, and Watertown.\nCambridge Savings Bank is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law. We are a VEVRAA Federal Contractor.","salary":"NOT_FOUND","date":"Just posted","full_text":"NOT_FOUND"},{"unique_id":"p_f1b032124a578ef2","city":"Massachusetts","job_qry":"data","job_title":"Data Analyst (Part-time)","company_name":"Holyoke Public Schools","location":"Holyoke, MA","link":"https:\/\/www.indeed.com\/viewjob?jk=f1b032124a578ef2","summary":"Primary Location FINANCE & OPERATIONS\n\nSalary Range PART TIME (12 MONTH)\n\nShift Type Part-Time","salary":"NOT_FOUND","date":"Just posted","full_text":"NOT_FOUND"},{"unique_id":"pj_f93ad49216c36d84","city":"Massachusetts","job_qry":"data","job_title":"Quality Inspector\/ CMM Programmer","company_name":"TML Manufacturing\/Technimetals","location":"NOT_FOUND","link":"https:\/\/www.indeed.com\/viewjob?jk=f93ad49216c36d84","summary":"CMM Programmer \/ Inspector Job Description Job Responsibilities: Provide CMM programming and operation supporting the quality and manufacturing departments. Maintains quality standards by approving incoming materials, in-process production, and finished products; recording quality results.Job Duties:  Programming and operating CMM equipment; Brown & Sharpe automatic, semi- automatic and Keyence. Control all aspects of inspection equipment calibration. Keeps measurement equipment operating by following operating procedures and work instructions; following calibration due dates. Assist with documentation control through ISO Standards. Inspects incoming and\/or in-process production machined components by confirming specifications; conducting visual and measurement tests; communicating required adjustments to production supervisor\/leader. Conducts First Article Inspections (FAI’s) and documenting results. Documents inspection results by completing reports and logs; completing NCMR’s,CAR’s when required; inputting data into quality database. Maintains safe and healthy work environment by following standards and procedures; complying with legal regulations. Updates job knowledge by participating in educational opportunities; reading technical publications. Accomplishes quality and organization mission by completing related results as needed. Other tasks as assigned.CMM Programmer \/ Inspector Job DescriptionIssue Date: 16-Jan-20Page 1* of 2*Skills and Qualifications: CMM Programming, Analyzing Information, Able to interpret Blueprints\/Drawings, ReportingResults, Documentation Skills, Promoting Process Improvement, Manufacturing Methods andProcedures, Supports Innovation, 3D Modeling, Inspection\/Measurement equipment.Education: Technical (Trade) School Certificate, Associate Degree, Bachelor DegreeReports to: Quality ManagerCMM Programmer \/ Inspector Job DescriptionIssue Date: 16-Jan-20Page 2* of 2*Job Type: Full-timeWork Location:One locationBenefits:Health insuranceDental insuranceRetirement planPaid time offTypical start time:8AMTypical end time:4PMPay Frequency:Bi weekly or Twice monthlyThis Job Is Ideal for Someone Who Is:Dependable -- more reliable than spontaneousAdaptable\/flexible -- enjoys doing work that requires frequent shifts in directionDetail-oriented -- would rather focus on the details of work than the bigger picture","salary":"NOT_FOUND","date":"Just posted","full_text":"NOT_FOUND"},{"unique_id":"pj_42b310de4665aae2","city":"Massachusetts","job_qry":"data","job_title":"Agent I Contact Center","company_name":"Retail Business Services, LLC","location":"NOT_FOUND","link":"https:\/\/www.indeed.com\/viewjob?jk=42b310de4665aae2","summary":"Retail Business Services, LLC, is the services company of Ahold Delhaize USA, currently providing services to five East Coast grocery brands, including Food Lion, The GIANT Company, Giant Food, Hannaford and Stop & Shop. Retail Business Services leverages the scale of the local brands to drive synergies and provides industry-leading expertise, insights and analytics to local brands to support their strategies with services including Information Technology, Merchandising, Marketing & Sourcing Services, Private Brand Products, Pharmacy Services, Not for Resale, Store Services, Financial Services, Legal Services, Communications, Supply Chain and People Systems and Services. Retail Business Services operates across seven campuses in the Greater Charlotte, Harrisburg, D.C., Portland, Boston and Chicago Areas. For more information, visit www.retailbusinessservices.com. To stay updated with the latest news, follow Retail Business Services on LinkedIn (@Retail-Business-Services) and Twitter (@RBServicesNews).Position Title: Agent I Contact CenterPosition Location: Quincy, MAPosition Summary:The Customer Agent will be responsible for providing direct support to store personnel, as well as customers, in an effort to ensure proper service levels are met on a 7 day x 24 hour basis. Provide excellent customer service to both internal and external customers. Enhance customer loyalty through engagement via phone and email. Provide clear information or direction with regard to actions required by customers (internal and external) in order to fully address their concerns. Provide direct support to store personnel and customers for Technology, Merchandising, Store Maintenance, Operations, Order Add\/Cuts, Order call Block Polling; online orders; digital offers; and loyalty programs.Principle Duties and Responsibilities:> Work with customers and stores to document, resolve and\/or escalate problems being reported. As part of the process, record required contact information and problem description in the appropriate application. Call content, appropriate notifications, error messages, problem classification and severity are critical to the problem review and resolution process.> Strive to provide appropriate resolution at the first point of contact.> Gather data during the problem solving process, analyze the situations, and provide solutions.> Utilize logical problem-solving skills and techniques to troubleshoot and resolve complex problems reported by stores and customers.> Demonstrate excellent writing, grammar, and computer skills in order to meet department standards. Demonstrate empathy and responsiveness to customers’ concerns.> Be alert to urgent or severe issues for immediate escalation, as well as trends that may negatively impact the company.> Take ownership of all calls and cases\/tickets opened; track the contact status to resolution utilizing the appropriate application.> Escalate complex and\/or high priority problems to appropriate coworkers, support groups, or vendors for resolution.> Ensure proper notification and escalation procedures are followed to update business users and customers.> Collaborate with other members of the team to manage calls including, but not limited to: Technology, Merchandising, Store Maintenance, Operations, Order Add\/Cuts, Order call Block Polling issues, Loyalty, Entertaining, and customer concerns.> Support tools\/applications to ensure all steps for error and service recovery have been performed in an effort to resolve reported problems prior to escalating to second level support groups.> Maintain solid documentation of issues as reported inclusive of any recommendations and\/or actions taken. This includes maintaining best practices that will handle the functional requirements for supporting Customer Care, Loyalty, WebCare, Technical, Vendor, and user issues in all stores as well as online.> Receive\/react to contacts from stores and customers> Escalate complex contacts to third level groups> Provide guidance and support to Agent 1 as needed; and when appropriate, assume responsibility for proper handling of said contact> Escalate unresolved issues when appropriate> Add newly provided information to shared document for future reference by the team> Exercise ability to influence other department decisions by providing customer feedback and metrics data (collected from department analyst)> Provide Agent 1 team with necessary training and support to achieve department goals> Monitor contact volume and adjust team responsibilities as needed> Assist Supervisor with scheduling needs> Assist Supervisor with management of team performance> Maintain documentation of processes performed in departmentBasic Requirements:1 - 2 Years of relevant contact center or IT helpdesk experienceBachelor's DegreeJob Type: Full-timePay: $1.00 - $2.00 per hourBenefits:401(k)Dental InsuranceHealth InsuranceLife InsurancePaid Time OffVision InsuranceSchedule:Monday to FridayExperience:Call Center: 1 year (Preferred)","salary":"NOT_FOUND","date":"Just posted","full_text":"NOT_FOUND"},{"unique_id":"p_3b7d62ddf5b8eed9","city":"Massachusetts","job_qry":"data","job_title":"Sr. Data Analyst","company_name":"Raybeam, Inc.","location":"Newburyport, MA","link":"https:\/\/www.indeed.com\/viewjob?jk=3b7d62ddf5b8eed9","summary":"Please do not apply through Indeed.The only way you will be considered is if you follow the link at the bottom of the page and take a very short quiz.What are we looking for?We are looking for a technically savvy database-oriented Analyst with good people skills and the ability to pick up new business concepts and technologies.The ideal candidate will possess: At least 4 years of experience.A strong to very strong working knowledge of SQL and Python.An ability to write and troubleshoot complex SQL procedures.The desire to understand business events through data.An understanding of Data Warehousing and ETL techniques.High level understanding in at least one scripting language such as Ruby, Shell, Python.An interest in learning large data set processing with MapReduce\/Hadoop\/Pig\/etc.Linux skills are a plus.Good client relations skills strongly preferred.Who are we?Raybeam, Inc. is a software engineering and consulting company focused on strategic consulting, business intelligence, and online\/database marketing for the past fifteen years. We have offices near Boston and San Francisco and support a strong list of clients including Google, Facebook, Microsoft, eBay, Disney, One Kings Lane, Beachbody and Hilton Worldwide.What do we do?We provide technology solutions by architecting and developing enterprise systems using a variety of programming languages, tools and platforms. This can range from building data warehouses, to web applications to implementing reporting platforms. We work in small teams, own the projects that we work on, and have direct input into the business decisions of our clients.What do you get from working for Raybeam?A fun, supportive work environment that promotes camaraderie and growth.The chance to travel and network with important figures in the industry.The chance to have input into business decisions of our clients.The opportunity to learn technologies that you've always wanted but never had the chance.If you are interested in applying for the position please click on the link below to take a short quiz.http:\/\/careerseval.raybeam.com\/sign_inPlease note that Raybeam, Inc. is currently unable to provide sponsorship and we will only consider local candidates. Recent grads are encouraged to apply, and an MBA is desirable. Thank You.Job Type: Full-timePay: $110,000.00 - $150,000.00 per yearBenefits:401(k)401(k) MatchingDental InsuranceDisability InsuranceFlexible ScheduleHealth InsuranceLife InsurancePaid Time OffParental LeaveReferral ProgramVision InsuranceSchedule:Monday to FridaySupplemental Pay:Bonus PayCOVID-19 considerations:Due to COVID, all employees are currently working remotely. When it is safe to do so, we will return to the office.Location:Newburyport, MA (Required)Work authorization:United States (Required)Company's website:www.raybeam.comBenefit Conditions:Only full-time employees eligible","salary":"\n$110,000 - $150,000 a year","date":"Just posted","full_text":"NOT_FOUND"},{"unique_id":"p_4f6f26e5459d1e6b","city":"Massachusetts","job_qry":"data","job_title":"CUSTOMER DATA ANALYST","company_name":"Cytiva","location":"Marlborough, MA 01752","link":"https:\/\/www.indeed.com\/viewjob?jk=4f6f26e5459d1e6b","summary":"Maintain Oracle Customer Master database integrity and ensure efficient screening of our new customers\/current customers\nReview, update, and correct data; delete and\/or merge files containing duplicate information\nObtain further information for incomplete documents\nCheck completed work for accuracy\nHave a zest to learn about the various interfaces connect with Oracle Customer Master\nDevelop an understanding of end to end customer account creation and processes to provide quick and world class experience to our customers\nComply with data integrity and security policies\nCreate and maintain SOPs and User Guides for ways of working\nWorks as part of a global team on different projects and helps with requirement gathering, testing and implementation.\nRun reports in Excel, Access, SQL Developer and inhouse data gathering programs\nParticipate in the creation and maintenance of dashboards that can be used to drive business results\nBuild an understanding of where to get key information and how to present it to the functional and technical teams\nDrive continues improvement by analyzing and challenging business processes to determine the most efficient ways to work\nMaintain filing and records management systems and other office flow procedures which may be confidential","salary":"NOT_FOUND","date":"Just posted","full_text":"NOT_FOUND"},{"unique_id":"pj_706baef7ca7e478b","city":"Massachusetts","job_qry":"data","job_title":"Dental Receptionist","company_name":"Confidential","location":"NOT_FOUND","link":"https:\/\/www.indeed.com\/viewjob?jk=706baef7ca7e478b","summary":"We are a growing, progressive and fun pediatric dental practice searching for a self-motivated individual to handle various front desk related tasks. We are seeking an outgoing personality who is able to work both individually and as part of our team. Professional appearance, ability to multitask, courteous phone skills and self-motivated are a few of the qualities in our desired candidate. Responsibilities will include answering phones, filing, insurance verification, data entry, scheduling and confirming appointments. Experience in the dental field is a must. This position is full time and does include two Saturdays per month.Job Type: Full-timePay: $16.00 - $18.00 per hourBenefits:401(k)401(k) matchingFlexible spending accountHealth insurancePaid time offSchedule:Monday to FridayWeekendsExperience:dental receptionist: 1 year (Preferred)receptionist: 1 year (Preferred)Education:High school or equivalent (Preferred)Work Location:One locationTypical start time:8AMTypical end time:6PMJob Duties:Greeting visitorsSchedulingCorrespondenceAnswering and routing phone callsThis Company Describes Its Culture as:Detail-oriented -- quality and precision-focusedOutcome-oriented -- results-focused with strong performance cultureTeam-oriented -- cooperative and collaborativeBenefit Conditions:Waiting period may apply","salary":"\n$16 - $18 an hour","date":"Just posted","full_text":"NOT_FOUND"},{"unique_id":"pj_74d9e2f8a98a7345","city":"Massachusetts","job_qry":"data","job_title":"Business Systems Analyst","company_name":"Amphenol Pcd","location":"NOT_FOUND","link":"https:\/\/www.indeed.com\/viewjob?jk=74d9e2f8a98a7345","summary":"Amphenol Pcd is looking to add a Business Systems Analyst to their stellar IT team.\n\nAbout Us:\nAmphenol Pcd (APcd) is a Division of Amphenol Corporation (www.amphenol.com - NYSE: APH), one of the largest manufacturers of interconnect products in the world. At APcd, we are dedicated to providing users in the Commercial and Military-Aerospace markets with a wide variety of high reliability, high performance connectors and rugged system packages. The primary end markets for our products are the commercial and military aerospace industry\n\nBrief Summary of Responsibilities\nAs our Business Systems Analyst, you will be the main contact for issues and projects related to our ERP System as well as manage multiple interface, access and requirements from users related to the Business Application Systems.\n\nEssential Functions:\nTroubleshooting of our ERP as well as managing related projects\nApplication maintenance\nGenerate and customize reports\nProvide maintenance for the SQL Database\n\nRequired Skills\/Experience:\nExperience and understanding of ERP systems – Macola experience a plus\nFamiliar with Exact Synergy\nProgramming in SQL and VBA or similar macros environment\nFluent in English\n\nDesired Skills\/Qualifications:\nProject Management\nMicrosoft BI\nCrystal Reports\n\nMinimum of 3 years directly related experience\n\nDue to the nature of our business, we are unable to provide sponsorship. Position requires candidate to be a U.S. person as defined in ITAR, 22 CFR 120.15 (U.S. Citizenship or Legal Permanent Resident) and defined by 8 U.S.C. 1101(a) (20).\n\nAmphenol Pcd is an Equal Opportunity\/Affirmative Action Employer. All qualified applicants will be given equal consideration regardless of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, pregnancy, genetic information, veteran status, or any other category protected by law.\nThis organization participates in E-Verify","salary":"NOT_FOUND","date":"Just posted","full_text":"NOT_FOUND"},{"unique_id":"pj_7541ceeccbf46ba8","city":"Massachusetts","job_qry":"data","job_title":"Regulatory Affairs Specialist","company_name":"Integrated Resources, Inc","location":"NOT_FOUND","link":"https:\/\/www.indeed.com\/viewjob?jk=7541ceeccbf46ba8","summary":"Job Title: Regulatory Affairs Specialist Job Location: Tewksbury, MA Job Duration: 6 Months (Possible Extension) Purpose of Position: Regulatory Affairs Coordinator supports regulatory affairs department in many areas including new product review, regulatory filings, promotional material review, label review, regulation research & interpretation, regulatory projects, response to regulators, regulatory procedures, customer inquiries, post market review and other activities as assigned. Regulatory Affairs specialist works within the regulatory team to ensure products meet necessary registration or approval from the local or international health authority.Key Responsibilities: Coordinate, prepare or maintain regulatory filings or submissions to obtain and sustain product approval.Support regulatory plans for assigned products.Document and maintain regulatory procedures, work instructions, or policies.Review promotional materials, labeling, specification sheets, or test methods for compliance with applicable regulations and policies.Support regulatory related projects (UDI, EU MDR\/IVDR, LVD, EMC).Conduct New Product Review using SharePoint based system.Participate on new product project teams and provide inputs for premarket regulatory requirements, labeling requirements, or clinical study.Review proposed product, label or manufacturing changes for regulatory impacts.Stay updated on existing and changing regulations, standards, or guidance documents.Support internal and external audits.Research and interpret regulations to apply to appropriate product lines.Prepare and support responses to customer requests for information, such as product data, written regulatory affairs statements, surveys, or questionnaires.Support post-market surveillance, vigilance and field action activities.Compile and maintain regulatory documentation databases or systems.Qualifications: Strong technical writing skills and attention to detailProficient in information technology tools including electronic document management systems and Microsoft Office Applications: MS Word, Excel, PowerPointEffective written and verbal communication skills across all levels of the organizationMust be an effective communicator, and able to deliver messages through presentations, written and verbal communicationUtilizes sound and rational problem solving and decision-making processesAbility to handle multiple tasks concurrently and in a timely fashionGood interpersonal skills and ability to work effectively and efficiently in a team environment to accomplish goalMust display eagerness to learn and continuously improvePositive work attitude that supports teamwork and continuous improvementExperience: Bachelor’s Degree in technical specialty required (engineering, chemistry, or biology)2 years of regulatory affairs or quality experience in life sciences, medical device, in vitro diagnostics or regulated industryDesired Experience \/ Qualifications \/ Skills: Experience with regulations related to medical device, IVD, or biopharma productsExperience with FDA 21 CFR 820, ISO 13485, ISO 9001, or similarPrevious regulatory submission experiences (FDA 510k, CE Mark, eCTD, etc)Familiar with UDI, EU MDR\/IVDR, LVD, EMC regulations.Manager Must Haves: Attention to detailExperience with Medical Devices or IVDsFamiliarization with quality management systemsExperience with marketing materials#IRI2Job Type: ContractSchedule:Monday to Friday","salary":"NOT_FOUND","date":"Just posted","full_text":"NOT_FOUND"},{"unique_id":"pj_f51111fef22a9e44","city":"Massachusetts","job_qry":"data","job_title":"Director of Dining Services","company_name":"Parsons Hill Rehabilitation & Health Care Center","location":"NOT_FOUND","link":"https:\/\/www.indeed.com\/viewjob?jk=f51111fef22a9e44","summary":"Dining DirectorThe primary purpose of your position is to assume responsibility for planning, organizing, developing and directing the overall operation of the Dining Services Department in accordance with current federal, state, and local standards, guidelines, and regulations governing our facility, and as may be directed by the Administrator and\/or Corporate Director of Food Service Administration to assure that quality nutritional services are provided on a daily basis and insure that the dining services department is maintained in a clean, safe, and sanitary manner.SCOPE OF RESPONSIBILITYAs the Director of Dining Services, you are responsible and accountable to carry out your assigned duties. You report directly to the Administrator.JOB FUNCTIONEvery effort has been made to keep your job description as complete as possible. However, it in no way states or implies that these are the only duties you will be required to perform. The omission of specific statements of duties does not exclude them from the position, the position includes any other duties deemed appropriate and assigned by the Administrator and\/or Corporate Director of Food Service Administration.WORKING CONDITIONSWorks in office areas as well as throughout the facility’s dining services and throughout facility areas (i.e., dining rooms, resident rooms, activity rooms, etc.).Sits, stands, lifts, and moves intermittently during working hours.Is subject to frequent interruptions.Is involved with residents, personnel, visitors, government agencies\/personnel, etc., under all conditions\/circumstances.Is subject to hostile and emotionally upset residents, family members, etc.Communicates with the medical staff, nursing staff and other department supervisors.May be exposed to heat\/cold temperatures in kitchen\/storage areas.Works beyond normal duty hours, on weekends and holidays when necessary in other positions temporarily when necessary. Scheduled hours may change to meet the needs of the facility.Attends and participates in continuing educational programs.Is subject to falls, burns from equipment, odors, exposure from chemicals, etc., throughout the workday.Maintains a liaison with other department supervisors to adequately plan for dining services activities.EDUCATION REQUIREMENTSMust possess, as a minimum a high school diploma. Must have completed an accredited course in dietic training approved by the American Dietetic Association and state agencies.EXPERIENCEA minimum of two (2) years experience in a supervisor capacity in a hospital, skilled nursing care facility or other related medical field is preferred. Must have training in cost control, food management, diet therapy, etc.SPECIFIC REQUIREMENTSMust be able to read, write, speak and understand the English language.Must possess the ability to make independent decisions when circumstances warrant such action.Must possess the ability to deal tactfully with personnel, residents, family members, visitors, government agencies\/personnel and the general public.Must be knowledgeable of dining service practices and procedures as well as the laws, regulations and guidelines governing dining services functions in the long-term care facility, including JCAHO.Must possess leadership ability and willingness to work harmoniously with and supervise professional and non-professional personnel.Must have the ability to plan, organize, develop, implement and interpret the programs, goals, objectives, policies, procedures, etc., of the Dining Services Department.Must maintain the care and use of supplies, equipment, etc., and maintain the appearance of dining service areas, must perform regular inspections of dining services area for sanitation order, safety, and proper performance of assigned duties.Must have patience, tact, cheerful disposition and enthusiasm, as well as the willingness to handle residents based on whatever maturity level they are currently functioning.Must possess the ability to seek out new methods and principles and be willing to incorporate them into existing dining services practices.Must be able to read and interpret dining services cost reports, financial data, etc.Must be able to relate information concerning a resident’s condition.PHYSICAL AND SENSORY REQUIREMENTS(With or Without the Aid of Mechanical Devices)Must be able to move intermittently throughout the day.Must be able to speak and write the English language in an understandable manner.Must be able to cope with the mental and emotional stress of the position.Must possess sight\/hearing senses or use prosthetics that will enable these senses to function adequately so that the requirements of this position can be fully met.Must function independently, have flexibility, personal integrity, and the ability to work effectively with the residents, personnel , and support agencies.Must be in good general health and demonstrate emotional stability.Must be able to relate to and work with ill, disabled, elderly, emotionally upset, and at times, hostile people within the facility.Must be required to lift, push, pull and move equipment, supplies etc., without restriction.Must be able to assist in the evacuation of residents in an emergency situation.MAJOR DUTIES AND RESPONSIBILITIESMeet sanitation standards.Must be able to provide point of service meal delivery.Follow all therapeutic diet guidelines including proper temperatures and serving times.Educate department staff in all aspects of dining service functions.Assure the planning, preparation, and serving of all therapeutic diets.Maintain all dining service equipment in a clean, and safe manner.Maintain sufficient inventory according to policy\/procedure including emergency supply.Assure that staff is screened for communicable disease.Formulate menu planning with guidelines of dietician.Assure that menus are accurately adhered to and appropriate substitutions are made per policy.Delegate authority to competent staff in his\/her absence.Provide dining services for any\/all in-house functions.Ensure quality and quantity of all deliveries.Demonstrate correct safety techniques.Respect and take care of facility equipment and is not wasteful of supplies.Contribute to effective communication and pleasant working conditions.Contribute to and promote positive resident and family relations.Follow facility policies and procedures.Is knowledgeable in and ensures staff comply with privacy practices to protect residents’ health information.Continue growth and expand job knowledge.Demonstrate leadership skills.Maximize the potential of each employee supervised and maintain up to date evaluations.CORPORATE COMPLIANCEFully complies with all federal and state laws and standards of ethical and professional conduct applicable to the position.Knowledge about laws and regulations relating to job responsibilities, e.g., EEO, OSHA, patient rights, fraud\/abuse laws.Is consistently truthful and accurate in all written and verbal communication.Demonstrates adherence to employee code of ethics and conduct. (Refer to personnel policies).Exhibits ethical\/moral responsibility in problem resolution and decision making.Required documentation\/record keeping is accurate, complete and timely.Reports suspected violations of federal and state laws and any types of misconduct to facility administrator, or other appropriate staff member.ACKNOWLEDGEMENTI have read this job description, reviewed the performance evaluation, and fully understand the requirements set forth therein. I hereby accept the position of Director of Dining Services and agree to abide by the requirements set forth and will perform all duties and responsibilities to the best of my ability.I further understand that my employment is at-will and thereby understand that my employment can be terminated at-will by the facility or myself, and that such termination can be made with or without notice.__________________ _____________________________________________Date Signature – Director of Dining Services__________________ _____________________________________________Date Signature - AdministratorJob Type: Full-timeSchedule:Monday to FridayExperience:Food: 1 year (Preferred)Management: 1 year (Preferred)Food Service Management: 1 year (Preferred)Food & Beverage Management: 1 year (Preferred)Work Location:One locationWork Remotely:No","salary":"NOT_FOUND","date":"Just posted","full_text":"NOT_FOUND"},{"unique_id":"pj_fb39675664f952ee","city":"Massachusetts","job_qry":"data","job_title":"Quality and CIP Manager with ISO","company_name":"Reardon Associates","location":"NOT_FOUND","link":"https:\/\/www.indeed.com\/viewjob?jk=fb39675664f952ee","summary":"Six sigma and coating experience a plus!The Quality and Continuous Improvement Manager will drive company initiatives to improve operational efficiencies as well as ensure preparedness for external quality audits for several sites. This position requires a high energy positive attitude with the capability and desire to be continuously engaged with the Team to drive projects to completion.With a focus on quality and continuous improvement, the Quality Manager is accountable for timely and detailed oriented results. The impact of the projects will all make a positive contribution to lean manufacturing improvements and process efficiencies to improve operational profitability.Essential Job FunctionsCreate a lean culture by mentoring and creating training opportunities.Internal quality system audit and remediation skillsCollecting production data, analyzing outputs, and determining corrective courses of action to promote safety, quality, and efficiency.Identify ways to eliminate waste in production processes.Analyze and identify opportunities to reduce process variation, improve process capabilities and optimize process performance.Work with management to identify new process improvement opportunities in the areas of quality, cost, performance, and preventive and predictive maintenance.In-depth experience implementing Lean, 5S, Value Stream Map and KaizenReview and update business procedures and documents.Must have experience working in a regulated industry (ISO 17025, ISO 9001 or other)Quality System knowledge with ability to rapidly identify and resolve system gaps.Independently facilitate CAR, CAPA or Non-conformances Root Cause analysis [RCA].Evidence of effectively creating Prepared Quality System documents nd records.Ability to gather and quantify quality metrics and management presentation material.Support the Quality function and the business by maintaining professional business ethics and ensuring customers are treated with efficiency, courtesy, and respect.Bachelor’s Degree in Industrial, Manufacturing, Mechanical or Electrical Engineering or other related technical disciplineGreen Belt Certification required; Black Belt preferred.An outgoing detail-oriented person with superior communications skills, both verbal and written.Strong computer desktop tool proficiency & other manufacturing software (MS-Word, Excel, etc.)Routinely working in cross functional teams and influencing peers on project tasks.Proven experience effectively prioritizing workload to meet deadlines & work objectives.Effective quantitative ability, exceptional organizational (records) talent and analytical skills.Experience Required5-7 years: industry related experience within the optics industry and\/or analytical instrumentsJob Type: Full-timePay: $95,000.00 - $115,000.00 per yearSchedule:Monday to Friday","salary":"\n$95,000 - $115,000 a year","date":"Just posted","full_text":"NOT_FOUND"},{"unique_id":"p_2f8dd23a4caed999","city":"Massachusetts","job_qry":"data","job_title":"Production Manager","company_name":"Bart's Ice Cream Amherst","location":"Greenfield, MA 01301","link":"https:\/\/www.indeed.com\/viewjob?jk=2f8dd23a4caed999","summary":"A Western MA frozen food manufacturer is a seeking creative, energetic and dynamic person with a passion for food and food preparation to lead our production team and share ownership's vision to grow one of New England's' most iconic brands. The ideal candidate is entrepreneurial, creative, detail oriented with a passion for food and food preparation. This person will be working in a small business environment and will require energy, and problem solving skills while at the same time committed to fostering a positive and creative culture internally.\nResponsibilities\n*Oversee and manage all facets of the frozen food manufacturing process from sourcing ingredients, through production, to management of finished good inventory of 20 - 30 flavors of ice cream *Work will sales team to prepare production plans (30 - 60 days in advance) based on projections and compliance with allergens and FDA guidelines. *Source and organize all production related items (packaging and all natural ingredients) in advance of planned production days (2 -3 days a week). Manage raw goods and ingredient inventory, schedule production team and prepare for all aspects of production. *During 2 -3 production days a week, lead a four person production team in the manufacturing process of premium frozen dessert. Light to moderate manufacturing process with some heavy lifting of various ingredients and\/or inclusions. *Maintain all production related equipment including moderate set up and clean up. *Manage all aspects of production on inventory management using internal inventory management system. Must be comfortable with computers and have a curiosity and willingness to learn. *Responsibilities also include introduction of new flavor and or product ideas on a quarterly basis Customers or always looking for 'whats new' and this candidate will have the opportunity to use their desire to be creative around new flavors or offerings. *Qualifications *Strong desire to be light manufacturing environment with the opportunity to participate in the growth of a brand *Ideally, candidate will have 5 + years of food and food manufacturing experience. Dairy, frozen food is preferred *Experience with light frozen food manufacturing equipment *Serv Safe Certified *Comfortable with MS Office and\/or Google Docs to prepare production plans *Drivers License\n\nWe are looking forward to receiving your application. Thank you.\nAvailable shifts and compensation: We have available shifts all days of the week. Compensation is $25.00 - $30.00\/hour.\nAbout Bart's Ice Cream Amherst: At Barts, we only put what we love in our pints. That means local, high quality ingredients, and as much ice cream as we possibly can! Each and every pint is hand packed by our team of passionate ice cream enthusiasts. From our table to yours!\n\nBy applying to this job, you agree to receive periodic text messages from this employer and Homebase about your pending job application. Opt out anytime. Msg & data rates may apply.\n\nPowered by Homebase. Free employee scheduling, time clock and hiring tools.","salary":"\n$25 - $30 an hour","date":"Just posted","full_text":"NOT_FOUND"},{"unique_id":"pj_5599862818f6a16c","city":"Massachusetts","job_qry":"data","job_title":"Direct Support Professional","company_name":"NEEDS Center","location":"NOT_FOUND","link":"https:\/\/www.indeed.com\/viewjob?jk=5599862818f6a16c","summary":"COME GROW WITH US!The NEEDS Center has openings for Direct Support Professionals who will assist and support adults with developmental disabilities to live as independently as possible while enjoying all aspects of Community Living. Full time and Part-time positions available in Orleans MA.Payrate is from: $14.85 – $15.30 per hour plus our employee benefits.Our employees enjoy great benefits, such as health insurance, vision, dental, Life Insurance, Disability Insurance, retirement plan, FSA, Tuition Reimbursement and generous paid time off!Responsibilities include: - Assisting and supporting individuals in daily routines.- Implement clinical, educational and vocational programs.- Observe and record data for programs established in their Individual and Behavior support plans.- Participate with other team members to create a therapeutic environment that includes regular community membership.COVID-19 considerations: To keep all staff members safe we provide all safety gear. e.g. masks, gowns, face shields etc.Job Type: Full-timePay: $14.85 - $15.30 per hourBenefits:Dental InsuranceFlexible Spending AccountHealth InsuranceLife InsurancePaid Time OffParental LeaveRetirement PlanTuition ReimbursementVision InsuranceSchedule:Monday to FridayNight ShiftWeekendsExperience:dsp: 1 year (Preferred)caregiving\/direct patient care: 1 year (Preferred)License:driver's license (Required)Work Remotely:No","salary":"\n$14.85 - $15.30 an hour","date":"Just posted","full_text":"NOT_FOUND"},{"unique_id":"p_7f5618a19d6631c6","city":"Massachusetts","job_qry":"data","job_title":"Payments Operations Analyst","company_name":"Buildium","location":"Boston, MA 02210 (South Boston area)","link":"https:\/\/www.indeed.com\/viewjob?jk=7f5618a19d6631c6","summary":"We're passionate about helping hard-working entrepreneurs grow their property management businesses. We're a collective of uniquely talented individuals who are at the top of our game and are determined to get better at what we do every day. There's zero competition or micromanagement—everyone is the master of their domain, ready to collaborate wholeheartedly with one another and celebrate each other's successes. Our determination to make our customers' lives better and break records is contagious—you find yourself becoming intensely passionate about the work that we do, even if the property management industry was never on your radar before you got here.\n\n\nJob Summary\n\nWe are looking for a candidate with banking experience who has the ability to apply their knowledge to a fast-paced, high-growth SaaS business. Buildium's payments vertical is the fastest growing part of our business and the Payments Operations Team is an essential piece of our ability to continue scaling. This role is central to managing the flow of funds through Buildium's payfac (payments facilitator). This person will help us operate and design the systems\/processes that will allow us to continuing accelerating our growth, while smartly managing our payments risk.\n\n\nWhat you'll do:\n\nHelp manage day-to-day operations for Buildium's payments risk management team\nResearch complex financial transactions and flow of funds through various payments platforms\nGather information, manage reporting and reply to requests from banking partners\nWork through received chargebacks and challenge requirements\nCommunicate professionally and clearly with our customers\nAssess current risk management processes, provide process improvement feedback and help design scalable systems\n\n\nWho you are:\n\nDetail-oriented, self-starter, who is eager to learn and take on new challenges\nSomeone who understands fundamental banking and accounting principles, including compliance and regulatory requirements for merchant processing\nPatient and calm under pressure, with the ability to advocate findings in a constructive manner\nAbility to be nimble, flexible and comfortable working in a fast-paced environment while upholding our organizational values and standards\nComfortable using various banking and payments user interfaces to gather reporting and organized data\nAAP (Accredited ACH Professional) certification is a big plus\nKnowledge of SQL a plus\n\n\nBenefits and Perks\n\nCasual and collaborative work environment\nFlexible time off\nMedical, dental & vision insurance\n401(k) retirement plan with company match\nParental leave\nFlexible spending and dependent care accounts\nCommuter benefits\nFree lunch Thursdays\nPing Pong, Foosball, etc\nFree snacks\n\n\nAt Buildium, we're always looking for smart, driven, enthusiastic professionals who want to join our team. Our vision is to create a 100-year company with a mission of helping small businesses succeed — all while setting the highest standard for the way business should be done. Those aren't just words on our wall — they are words we live by. We love what we do. We love what we're building. And we love our customers. If that sounds like something you want to be a part of, we want to hear from you.\n\n\nBuildium is an equal employment opportunity employer and considers qualified applicants without regard to gender, sexual orientation, gender identity, religion, race, veteran or disability status. We celebrate diversity and are committed to building an inclusive work environment where all employees feel a sense of belonging while bringing their authentic self to the table and being valued for it.","salary":"NOT_FOUND","date":"Just posted","full_text":"NOT_FOUND"},{"unique_id":"p_e14332e2fcee0d39","city":"Massachusetts","job_qry":"data","job_title":"Vice President of Strategies and Innovation","company_name":"Jenzabar","location":"Boston, MA 02199 (Back Bay area)","link":"https:\/\/www.indeed.com\/viewjob?jk=e14332e2fcee0d39","summary":"Summary\n\nResponsible for formulating and overseeing the development and execution of Jenzabar's (\"the company\") short and long-range strategic goals, financial objectives and related plans. Responsible for translating strategic business goals into operational plans and tactics to achieve strategic\/financial goals.\n\nResponsible for driving strategic technology innovation for continued company\/ business growth. Works in partnerships with key business leaders to prepare the company for the future; fosters and facilitates strategic thinking on innovative product initiatives.\n\nDefines and drives the product management strategy and business plan, short- and long-term growth strategy and positioning of the company's products in the market.\n\nResponsible for researching and developing effective and financially productive business partners.\n\nResponsibilities\n\nCORPORATE STRATEGY & PLANNING\n\nDevelop long-term, forward-thinking business strategies designed to keep the company ahead of competitors. Create\/generate strategic opportunities to expand revenue both organically and opportunistically (EG: M&A; business licensing, etc.). Lead the implementation of these strategic opportunities.\nResearch\/analyze future technological developments and changes in the marketplace to ensure Company is well positioned to take advantage of both; identify new markets and sources of potential growth; recommend new approaches to maintain Company's competitive edge. Responsible for the analysis of trends and developments in technology and for formulating strategic courses of action to maximize the Company's leverage within its market.\nDevelops market awareness, industry insights, and trend identification to provide strategic direction to the company. Gathers of market data, conducts vendor review and analysis, attends industry events, to development strategic relationships. Develops a process to disseminate insights throughout the organization.\nResponsible for analysis of business outcomes as they relate to products and services required \/anticipated by the market. Partners with product development\/engineering, operations, and service\/support leaders to ensure expected business outcomes.\n\nTECHNOLOGY INNOVATION\n\nLooks for ways to introduce new, innovative opportunities, from concept to market readiness.\nLeads the financial evaluation of potential business\/growth opportunities.\nBuilds effective cross-departmental partnerships to foster innovation throughout the company.\nLeads Jenzabar's strategic technology direction in order to deliver on innovative product initiatives, improving product management processes and support of managed products in market.\n\nPRODUCT MANAGEMENT STRATEGY\n\nDefines and oversees the product management strategy; roadmap and lifecycle of the company's product portfolio. Directs the end-to-end leadership of new and existing products from inception through all phases of the products' lifecycle.\nEnsure products meet the evolving needs of our customers and prospects. Recommend changes to existing approaches, product design, and product mix to maximize our market potential.\nChampions market analysis activities – market segmentation, research, forecasting, and market access\nDrive alignment across the organization.\nEnsures product initiatives are resourced and delivered in a timely, customer-embraced manner.\n\nPARTNERS\n\nResponsible for researching and developing effective, financially sound business partners to augment and expand company offerings.\nQualifications\nDegree in Business Administration; MBA preferred.\nMinimum of 10+ years of operational experience, including proven operational success in higher education and technology sectors.\nExcellent communication and presentation skills, both written and oral, as well as excellent listening skills.\nExcellent leadership skills, including the ability to develop trust and credibility, lead by example, and motivate high-performing teams.\nExcellent management skills, including the ability to supervise multiple disparate teams and develop talent.\nAbility to effectively manage multiple priorities in a complex environment.\nFluent in Finance matters including experience owning P&L and driving decisions around spend.","salary":"NOT_FOUND","date":"Just posted","full_text":"NOT_FOUND"},{"unique_id":"p_b6663c71b8d0f951","city":"Massachusetts","job_qry":"data","job_title":"Business Analyst (Consultant)","company_name":"Meradia","location":"Boston, MA","link":"https:\/\/www.indeed.com\/viewjob?jk=b6663c71b8d0f951","summary":"Meradia specializes in providing strategic advisory and implementation services to the investment management industry. We help our clients improve their results through a unique combination of technical expertise, experience, and a passionate commitment to our clients’ success.Our consultants’ diverse platform experience, breadth of knowledge, and collective expertise provide the insight needed to help solve client challenges and ensure project success. Since 1997, we have focused on assisting clients in succeeding while building a reputation for surpassing goals and exceeding expectations. From start to finish, your success is more important than our own. Whether starting a new initiative, upgrading an application, or getting your project back on track, we supply the resources, knowledge, and experience to drive change and deliver desired results.Meradia, a leader in Financial consulting and investment software, is seeking a Business Analyst.REQUIREMENTS Analyze business requirements by validating logic, feasibility and testing assumptions and make actionable for development.Provide functional guidance to the client through the successful development and integration of new systems.Provide clients with research and insight relating to software applications and technology, operations processing, reporting, and performance measurement.Develop and maintain project plans, status memos, procedural and operational documentation.SKILLS & ABILITIES Experience designing, developing and implementing technology solutions in the investment services industry.Experience working in or managing systems implementation and development projects that impact multiple departments.Proven record of analyzing business processes and developing practical solutions that drive efficiency, improve client service, and reduce risk.Ability to assess and document business needs: systems, data, integration, workflows, output, and the economic impact of each.Strong analytical and business skills.Excellent interpersonal, verbal, and written communication skills.KNOWLEDGE & EXPERIENCE Strong functional, technical, and operational expertise of the investment management industry.Fundamental knowledge of front, middle, and back-office operations in investment management organization, with a strong understanding of institutional client reporting.Strong knowledge of a broad range of investment management products, including US and global equities, fixed income, and derivative products.Understanding of multi-currency portfolio accounting.Experience writing business requirements, functional requirements and test plans.Basic knowledge of SQL preferred.MBA, CFA charter holder or candidate, CIPM designee, or candidate is strongly preferred.Willingness to travel is required.EDUCATION & EXPERIENCEBachelor’s Degree or equivalent experience. Specialty: Economics, Finance, Accounting, or Management. (Preferred)5+ years of relevant marketing industry experiencePrior experience in Investment Management or Consulting is requiredJob Type: Full-timePay: $61,603.00 - $160,895.00 per yearExperience:business analysis: 5 years (Required)Back Office\/Operations: 5 years (Required)Education:Bachelor's (Required)Work authorization:United States (Required)Required travel:50% (Required)Application Question:Please describe your approach and philosophy to a new project? Please elaborate.Work Location:Multiple locationsCompany's website:www.Meradia.com","salary":"\n$61,603 - $160,895 a year","date":"Just posted","full_text":"NOT_FOUND"},{"unique_id":"p_72c6d0d88e02fcbe","city":"Massachusetts","job_qry":"data","job_title":"Business Development \/ Marketing Specialist","company_name":"Stephan P. McMahon & Company","location":"Yarmouth, MA 02673 (West Yarmouth area)","link":"https:\/\/www.indeed.com\/viewjob?jk=72c6d0d88e02fcbe","summary":"To reinvent an industry, you must build the best team. Stephan P. McMahon & Company is not your typical tax advisory and business consulting firm. Our forward focused approach distinguishes our firm from most – and has resulted in SPM&Co experiencing considerable growth and doubling our revenue over the last 5 years. This growth has come organically from referrals by our clients and professional partnerships. Our good work is recognized and rewarded, and with your contributions we can take it to the next level!We are excited to embark on this next chapter – and are looking for a business development \/ marketing specialist to play a role in driving a targeted growth of our business by telling our brand story through creative outputs.Marketing at SPM&Co crosses all disciplines – content, operations, analytics, and more. Whether it is analyzing data to drive in the right clients, creating compelling content, or exploring new opportunities in the market and community, your work will impact the business level goals and help accelerate our revenue growth goals.If your experience includes hands-on leadership of a growing brand, marketing partnerships, campaign strategies, community expansion, and creative output (video, copy, photography, graphics and more), we want to hear your story.Key Responsibilities:- Community Involvement \/ Presence \/ Networking ~ identify and maintain a strong network of referral sources while also cultivating productive relationships with other business professionals- Exemplify Brand & Culture- Sales \/ Revenue Goals- Sales \/ Marketing Process- Get the Company in the “Right Rooms”- Online presence- Website \/ Blog – Effective & Consistent- Bring Differentiators to Focus – Consistent across brand- Client Presentation: Deliverables, Marketing Materials, Swag!Qualifications:- 3+ years of business development and marketing experience, including experience producing marketing materials and\/or content- Familiarity and comfort with Marketing Automation Platforms and managing digital ad campaigns- Superior written and verbal communication and presentation skills with the ability to influence- Passion for marketing and business development- Creativity and self-starter with a sense of urgency and goal-oriented- Collaborative nature- Curiosity and an aptitude for learning quickly- Strong problem-solving skillsJob Type: anticipate 25-30 hrs per week (specifics TBD with the right candidate), flexibility (required & given) and remote work available.We offer a rewarding and challenging work environment and the opportunity for personal and professional growth in a collaborative environment. We understand the importance of balancing professional and personal lives. We look forward to your addition.Competitive pay and benefit package offered, including paid time off, 10+ paid holidays per year, health insurance and retirement plan with company match.The firm is an equal opportunity employer.Job Types: Full-time, Part-timePay: $20.00 - $30.00 per hourBenefits:401(k)401(k) matchingFlexible scheduleHealth insurancePaid time offSupplemental Pay:Bonus payWork Location:One locationCompany's website:www.spmandco.comCompany's Facebook page:https:\/\/www.facebook.com\/spmandcoWork Remotely:Yes","salary":"\n$20 - $30 an hour","date":"Just posted","full_text":"NOT_FOUND"},{"unique_id":"p_aa4882a4b801fcbe","city":"Massachusetts","job_qry":"data","job_title":"SVP, Creative Strategy","company_name":"Digitas","location":"Boston, MA 02110 (Downtown area)","link":"https:\/\/www.indeed.com\/viewjob?jk=aa4882a4b801fcbe","summary":"Digitas is a highly-caffeinated playground where brilliant minds come together to make bold, award-winning advertising. We use data-driven insights to guide our work, but we also believe in a healthy dose of spirited storytelling as we strive to transform the marketing landscape. Right now, we’re searching for an SVP of Creative Strategy who can become a major asset when it comes to driving customer insights into all of our work. Your leadership will help teams create impactful creative marketing approaches. You’ll also play a giant role in identifying high-impact opportunities for innovation and all its approaches. You can take part in changing how marketing is perceived by the ever-powerful consumer.\n\nWhat You'll Do:\n✦ Lead a large team of creative strategists within a strategy “hub” serving a large financial services client \n✦ Lead presentations with senior level clients to share strategies, POVs, and insights \n✦ Proactively determine where and how in-depth insight about the consumer’s attitude and behavior can help make the client’s marketing more successful  Translate existing customer insights into relevant marketing program implications \n✦ Apply innovative research and listening methodologies to create relevant, breakthrough customer insights \n✦ Partner with our cutting-edge primary researchers, internal analysis group and client data\/research organizations to maximize their work’s customer insights  Create demand for strategy’s contribution by demonstrating its impact \n✦ Manage 2 VPs, and 3 mid-level strategists\nGot what it takes? We’d love to hear from you.\nDigitas is an equal opportunity employer.","salary":"NOT_FOUND","date":"Just posted","full_text":"NOT_FOUND"},{"unique_id":"p_f9e986fd2012e786","city":"Massachusetts","job_qry":"data","job_title":"HR and Operations Officer","company_name":"British International School of Boston","location":"Jamaica Plain, MA 02130","link":"https:\/\/www.indeed.com\/viewjob?jk=f9e986fd2012e786","summary":"HR: Recruitment & Appointments:· Work with the Head of School to oversee the recruitment process ensuring all the policies and procedures are adhered to;· Work with the Head of School to oversee the issuing of offer letters, contract variation letters and contracts as required;· Process background checks in line with current guidance;· Oversee compliance with NAE Safer Recruitment requirements;· Lead and oversee all aspects of the induction and relocation programmes for all staff.Staffing & Payroll:· Lead on and co-ordinate all matters related to pay and conditions, ensuring accuracy, compliance and appropriate approval at all stages;· Co-ordinate the annual appraisal, performance management and pay review administration, undertake reviews of job descriptions and person specifications;· Maintain the staffing costs information for the School and prepare projected costs;· Maintain the staffing establishment records and support the Director of Finance and Business with resource planning.Human Resources Administration:· Provide advice to staff regarding Employee Relations issues;· Provide HR support at formal HR meetings, including drafting invite letters and attending meetings as a note taker;· Assist with investigations, including providing advice and guidance to colleagues as necessary;· Manage the exit interview process, including conducting exit interviews as required;· Develop and maintain statistical data to provide performance indicators in relation to absence data, retention data, recruitment data;· Ensure HR files are created and maintained in keeping with guidance relating to this;· Liaise with HR Director for NAE North America, as and when required;· Undertake risk assessments for staff members, ensuring they are up to date, compliant with relevant guidance and all stakeholders are informed of their responsibilities;· Support the staff wellbeing and liaise with the Head of School.Operational Functions: · Liaise and maintain all aspects of the relationship and day to day matters with SHOWA and SODEXO, including but not limited to cleaning contractors, room bookings, safety concerns, traffic, contractors, maintenance, snow clearing, campus closures and graduation;· Liaise and maintain all aspects of the relationship with LocalMotion including but not limited to routes, driver concerns, safety concerns, stop locations, route timings and GPS tracking;· Run and maintain all aspects of cover supervision at BISB;· Ensure substitute teachers are available when required and liaise with cover staff regarding expectations;· Accurately manage cover on iSAMs at all times;· Develop and maintain an accurate calendar for the academic year and ensure this is shared with all stakeholders in an appropriate format;· Organise all logistical aspects of school events;· Maintain and effectively run all aspects of CHQ;· Oversee the management of extra-curricular clubs and other out of hours activities;· Liaise with administrators to ensure the smooth running of CHQ and the extra-curricular programme;· Assist on iSAMS related issues and implementation of new developments;· Administer PTC’s and other parental events, as required;· Work with the Examinations Officer in the organization of all logistical aspects of examinations both internal and external;· Lead and develop a whole-school communications programme which ensures highly effective communication with students and families including the maintenance of the BISB App;· Organise and maintain the school trips programme ensuring that each trip is appropriate and that all necessary paperwork is completed;· Line Management of facilities staff;· Assist the Health and Safety Officer to ensure that the school is compliant in all aspects of H&S;· Any other logistical duties as allocated by the Head of School.Job Type: Full-timePay: $45,000.00 - $50,000.00 per yearBenefits:401(k)Dental InsuranceHealth InsuranceVision InsuranceSchedule:Monday to FridayExperience:HR: 1 year (Preferred)Operations: 1 year (Preferred)Education:Bachelor's (Preferred)Location:Jamaica Plain, MA 02130 (Required)Work authorization:United States (Required)Work Location:One locationThis Company Describes Its Culture as:Innovative -- innovative and risk-takingPeople-oriented -- supportive and fairness-focusedTeam-oriented -- cooperative and collaborativeCompany's website:https:\/\/www.nordangliaeducation.com\/our-schools\/bostonWork Remotely:No","salary":"\n$45,000 - $50,000 a year","date":"Just posted","full_text":"NOT_FOUND"},{"unique_id":"p_1c727d371047e4a8","city":"Massachusetts","job_qry":"data","job_title":"Portfolio Development Specialist - New England","company_name":"Merz North America","location":"Massachusetts","link":"https:\/\/www.indeed.com\/viewjob?jk=1c727d371047e4a8","summary":"Job Details\nDescription\nThe Portfolio Development Specialist (PDS) will be responsible for delivering consistent performance results in sales achievement, territory development and executing strategic objectives in the ethical and compliant sales and promotion of the Merz Aesthetics NeoCutis Portfolio within a defined geographical area. Additionally, they will be responsible for initial Clinical and Marketing installation as well as advanced and continual training and marketing support for all practice development activities for the Merz Device consumable products. PDS will be responsible for driving patient acquisition and increase procedures within a practice in order to increase consumable\/ product sales within assigned territory. All information will be communicated in a compliant and ethical manner. PDS will also be responsible for up selling other elements of the full portfolio during trainings, installations and practice development meetings. All information will be communicated and sold within a compliant and ethical manner set by Merz Aesthetics.\n\nRESPONSIBILITIES:\n\nSales Execution & Account Planning\n\nConsistently achieve\/overachieve quarterly and yearly sales objectives with current and potential customers.\n\nBusiness Acumen\n\nUtilize monthly trunk stock effectively to increase market share and grow existing customer base.\nDevelop an individual account business plan to drive growth through strategic partnering of procedure and product pull through plans.\nConduct marketing installation on Merz Aesthetic Devices and Skincare and develop a 90-day working marketing plan.\nAssist practice in planning their Ultherapy and Neocutis promotional programs; provide hands on executional assistance in adapting and implementing promotional tactics.\nSupport virtual and\/or live promotional events.\nProvide virtual and\/or live clinical training related to new customer start up as well as advanced training on Ultherapy and Neocutis in order to improve clinical outcomes.\nProvide patient consultation coaching.\nTrain practice management personnel on available tools and resources.\nTrain practice staff how to sell Ultherapy and Neocutis to potential patients through role playing and “see one, do one, teach one” technique.\nImplement Neocutis post procedure protocols to ensure product pull through and establish a process to ensure reorders.\nConduct Advanced Neology programs live or virtual to integrate skincare into key activities in the practice.\nDemonstrate a high sense of urgency with internal and external stakeholders.\nResponsible for any other duties as assigned by Merz management.\n\nBusiness Hygiene\n\nEnsure full compliance of all business hygiene related activities to include (but not limited to): expense reporting, online module training, sample reporting and management for themselves.\n\n People\n\nAssist in identifying, assisting, and coordinating local per diem clinical educators to ensure effective coverage at all times.\nCoordinate any additional resources necessary to meet client’s needs.\nCollaborates with DTM, ITM and KAM for cross selling and support opportunities.\n\n Manage Territory Budget\n\nManage the day to day and quarterly territory budget.\nComplete all expenses through Concur at a minimum of a bi-weekly basis.\nEnsure all charges stay current on corporate issued credit cards.\n\nAnalytics\n\nAnalyze customer data to provide customer relationship management and recommendations.\nAnalyze data and sales statistics to translate results into better solutions.\n\n Communication\n\nBuild and develop a trusting relationship between major key customers and Merz.\nNotify Merz Aesthetic Device quality department regarding error codes and submit field incident reports as required.\nCollaborate with DTM and Merz Customer Solutions to ensure timely response to device installation request.\nEngage and participate during conference calls, and Area and National Sales Meetings.\n\nTravel\n\nThe percentage of travel (car, air, overnights) depends on the Territory size and needs; this role requires the willingness to do so in order to serve the customer and company’s needs.\nITM must live within or immediately outside of the territory’s geography.\n\nCompliance\n\nFollow all company’s policies and procedures in a compliant manner, while maintaining a high level on integrity.\n\nREQUIREMENTS:\n\nBS\/BA degree is required; preferably within medical device sales or business.\nMinimum of 3 years’ experience in aesthetics in either a Clinical, Marketing or blended role is required.\nAt least two years’ experience training others in clinical administration of aesthetic\/pharmaceutical products is required.\nDirect creation of tools, processes and programs designed to drive patient volume at an owner-operated business level is required.\nDemonstrated high level of Clinical, Sales and Business Acumen.\nAbility to finesse clinical information to reinforce customers decision to use\/purchase product.\nExcellent planning and organizational skills.\nExcellent verbal, written communication and relationship management skills required.\nAbility to forge strong relationships with clients and utilize client relationships to increase device utilization and portfolio penetration.\n\nQualifications\nEducation\nRequired\nBachelors or better.\nExperience\nRequired\n2 years: At least two years’ experience training others in clinical administration of aesthetic\/pharmaceutical products is required.\n3 years: Minimum of 3 years’ experience in aesthetics in either a Clinical, Marketing or blended role is required.\nEqual Opportunity Employer\/Protected Veterans\/Individuals with Disabilities\nThe contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor’s legal duty to furnish information. 41 CFR 60-1.35(c)","salary":"NOT_FOUND","date":"Just posted","full_text":"NOT_FOUND"},{"unique_id":"pj_42b310de4665aae2","city":"Massachusetts","job_qry":"data","job_title":"Agent I Contact Center","company_name":"Retail Business Services, LLC","location":"NOT_FOUND","link":"https:\/\/www.indeed.com\/viewjob?jk=42b310de4665aae2","summary":"Retail Business Services, LLC, is the services company of Ahold Delhaize USA, currently providing services to five East Coast grocery brands, including Food Lion, The GIANT Company, Giant Food, Hannaford and Stop & Shop. Retail Business Services leverages the scale of the local brands to drive synergies and provides industry-leading expertise, insights and analytics to local brands to support their strategies with services including Information Technology, Merchandising, Marketing & Sourcing Services, Private Brand Products, Pharmacy Services, Not for Resale, Store Services, Financial Services, Legal Services, Communications, Supply Chain and People Systems and Services. Retail Business Services operates across seven campuses in the Greater Charlotte, Harrisburg, D.C., Portland, Boston and Chicago Areas. For more information, visit www.retailbusinessservices.com. To stay updated with the latest news, follow Retail Business Services on LinkedIn (@Retail-Business-Services) and Twitter (@RBServicesNews).Position Title: Agent I Contact CenterPosition Location: Quincy, MAPosition Summary:The Customer Agent will be responsible for providing direct support to store personnel, as well as customers, in an effort to ensure proper service levels are met on a 7 day x 24 hour basis. Provide excellent customer service to both internal and external customers. Enhance customer loyalty through engagement via phone and email. Provide clear information or direction with regard to actions required by customers (internal and external) in order to fully address their concerns. Provide direct support to store personnel and customers for Technology, Merchandising, Store Maintenance, Operations, Order Add\/Cuts, Order call Block Polling; online orders; digital offers; and loyalty programs.Principle Duties and Responsibilities:> Work with customers and stores to document, resolve and\/or escalate problems being reported. As part of the process, record required contact information and problem description in the appropriate application. Call content, appropriate notifications, error messages, problem classification and severity are critical to the problem review and resolution process.> Strive to provide appropriate resolution at the first point of contact.> Gather data during the problem solving process, analyze the situations, and provide solutions.> Utilize logical problem-solving skills and techniques to troubleshoot and resolve complex problems reported by stores and customers.> Demonstrate excellent writing, grammar, and computer skills in order to meet department standards. Demonstrate empathy and responsiveness to customers’ concerns.> Be alert to urgent or severe issues for immediate escalation, as well as trends that may negatively impact the company.> Take ownership of all calls and cases\/tickets opened; track the contact status to resolution utilizing the appropriate application.> Escalate complex and\/or high priority problems to appropriate coworkers, support groups, or vendors for resolution.> Ensure proper notification and escalation procedures are followed to update business users and customers.> Collaborate with other members of the team to manage calls including, but not limited to: Technology, Merchandising, Store Maintenance, Operations, Order Add\/Cuts, Order call Block Polling issues, Loyalty, Entertaining, and customer concerns.> Support tools\/applications to ensure all steps for error and service recovery have been performed in an effort to resolve reported problems prior to escalating to second level support groups.> Maintain solid documentation of issues as reported inclusive of any recommendations and\/or actions taken. This includes maintaining best practices that will handle the functional requirements for supporting Customer Care, Loyalty, WebCare, Technical, Vendor, and user issues in all stores as well as online.> Receive\/react to contacts from stores and customers> Escalate complex contacts to third level groups> Provide guidance and support to Agent 1 as needed; and when appropriate, assume responsibility for proper handling of said contact> Escalate unresolved issues when appropriate> Add newly provided information to shared document for future reference by the team> Exercise ability to influence other department decisions by providing customer feedback and metrics data (collected from department analyst)> Provide Agent 1 team with necessary training and support to achieve department goals> Monitor contact volume and adjust team responsibilities as needed> Assist Supervisor with scheduling needs> Assist Supervisor with management of team performance> Maintain documentation of processes performed in departmentBasic Requirements:1 - 2 Years of relevant contact center or IT helpdesk experienceBachelor's DegreeJob Type: Full-timePay: $1.00 - $2.00 per hourBenefits:401(k)Dental InsuranceHealth InsuranceLife InsurancePaid Time OffVision InsuranceSchedule:Monday to FridayExperience:Call Center: 1 year (Preferred)","salary":"NOT_FOUND","date":"Just posted","full_text":"NOT_FOUND"},{"unique_id":"p_2806224868cefb98","city":"Massachusetts","job_qry":"data","job_title":"Cash Receipts\/Collections Coordinator","company_name":"South Shore Health","location":"Weymouth, MA 02190 (South Weymouth area)","link":"https:\/\/www.indeed.com\/viewjob?jk=2806224868cefb98","summary":"Requisition Number: 64587\n\nFacility: LOC0001 - 55 Fogg Road55 Fogg Road\nWeymouth, MA 02190\n\nDepartment Name: VNA Patient Accounts\n\nStatus: Full time\n\nBudgeted Hours: 40\n\nShift: Day (United States of America)\n\nUnder the supervision of the Collections\/Insurance Authorization Supervisor, is responsible for cash receipts and collections being processed in a timely manner, as directed by Supervisor. Also performs various clerical duties, computer adjustments and maintaining logs and spreadsheets for the Auditors.\nESSENTIAL FUNCTIONS\n\nEssential functions are those tasks, duties and responsibilities that comprise the means of accomplishing the job's purpose and objectives. Essential functions are critical or fundamental to the performance of the job. They are the major functions that the person in the job is held accountable for. Following are the essential functions of the job.\n\n\nUse this to denote if a function does not provide opportunity to perform beyond \"Meets Expectations\"\n\n1. Under the supervision of the Collections\/Insurance Authorization Supervisor, performs various clerical duties pertaining to Cash Receipts and Collections.\n\n2. Breakdown of daily deposit and disbursing to HHR and Hospice with appropriate documentation.\na. Copying all checks for VNA, Petty Cash duties and sending donation checks to Foundation Department.\n\n3. Daily cash receipts applications are entered into the computer and confirm that cash entries balance with the daily deposit via batches. Notes in comment section of cash application on services paid incorrectly or denied.\n\na. Downloading of Harvard Pilgrim Remits\n\nb. Downloading of MassHealth List for A\/R\n\n4. Investigates and researches credits on accounts determining whether overpays or computer errors and adjusts accounts accordingly.\na. Sends letter to appropriate insurance companies to notify them of overpayment.\n\nb. When invoice is received from insurance company, request check from Accounts Payable for refund.\n\nc. Make necessary adjustment in the computer of the refund.\n\n5. Forwards required cash information to South Shore Health & Educational Corporation Accounting Department monthly and deals with South Shore Hospital - Finance Department on any questions or problems pertaining to cash.\na. Enter all deposit totals on Excel spreadsheets in shared directory between Finance Department and Accounts Receivable.\n\nb. Forward required cash information to Finance Department monthly. Communicate with Finance Department on cash related issues till resolution has been reached.\n\nc. Detail Medicare Figures since payment is daily.\n\n6. Enters monthly write–offs in the computer software (free care, allowance).\n\n7. Accounts Receivable\/Collections tracking which include follow up on claims for appeals, reconciliation of accounts due to rate issues, authorizations, denials, timely filings, coding problems, whether current or past due – working closely with supervisor regarding these issues and calling the respective insurance company (non-government payors) regarding these issues.\na. Works closely with the Insurance Liaisons to resolve authorization denials.\n\n8. Resolving any patient issues that may arise through inquiries regarding insurance payments not processed correctly. Document in computer software system all conversations with patients, clinical staff, or insurance carriers in comment section of system.\n\n9. Updates Aging Report notes.\n\n10. Basic knowledge of operations within the Insurance Department for emergency backup should the need arise.\n11. Weekly reporting to supervisor of denied claims and current status.\n\n12. Works with the AR department to resolve payor changes as related to patient billing.\n\n13. Performs other duties as required and assigned.\n\n14. Maintains confidentiality of all information\/data utilized and does not discuss same outside the realm of job responsibilities.\n\nESSENTIAL FUNCTIONS (Cont.)\n\nI. Technology and Learning\na. Participates in continued learning and possess a willingness and ability to learn and utilize new technology and procedures that continue to develop in their role and throughout the organization.\n\nb. Embraces technological advances that allow us to communicate information effectively and efficiently based on role.\n\nNON-ESSENTIAL FUNCTIONS\n\nNon-essential functions are those tasks, duties and responsibilities that are not critical to the performance of the job. Following are non-essential functions of the job, along with the corresponding performance standards.\n\n1. Other duties as required.\n\nTraining or experience with PC spreadsheet software desirable. Experience in Cash Receipts, Credits and Collections. Prior experience in VNA environment.\n\nResponsibilities if Required:\nEducation if Required:\nLicense\/Registration\/Certification Requirements:","salary":"NOT_FOUND","date":"Just posted","full_text":"NOT_FOUND"},{"unique_id":"p_f12fa2ab593b56fd","city":"Massachusetts","job_qry":"data","job_title":"Customer Service Representative","company_name":"Sharecare Inc","location":"Beverly, MA 01915","link":"https:\/\/www.indeed.com\/viewjob?jk=f12fa2ab593b56fd","summary":"Sharecare is the digital health company that helps people manage all their health in one place. The Sharecare platform provides each person - no matter where they are in their health journey - with a comprehensive and personalized health profile, where they can dynamically and easily connect to the information, evidence-based programs and health professionals they need to live their healthiest, happiest and most productive life. With award-winning and innovative frictionless technologies, scientifically validated clinical protocols and best-in-class coaching tools, Sharecare helps providers, employers and health plans effectively scale outcomes-based health and wellness solutions across their entire populations. We are always looking for people that value the opportunity to work hard, have fun on the job, and make a difference in the lives of others through their work every day!\n\n\nSharecare Health Data Services is a wholly owned subsidiary of Sharecare. The Inbound Call Center Representative will demonstrate that they are culturally aligned with Sharecare Health Data Services, by displaying and working within the values of Servant Leadership, Family, Sharing Care, Compassion, Accountability and Respect for their leader and their peers. They will be innovative, open to change, and display honesty and integrity in all that they do.\n\n\nJob Summary:\nThis position assists incoming callers with requests and providing great customer service. An upbeat, patient-centered attitude is a must! Our employees must, at all times, safeguard and protect patients' right to privacy. We are responsible for ensuring that only authorized individuals have access to our patients' medical information and that all releases of information are in compliance with the request, authorization, company policy and HIPAA regulations. Applicants should have familiarity with medical terminology and medical office processes and procedures.\n\n\nEssential Functions:\nAssists incoming callers with the process of submitting a request for medical records\nProvide status updates regarding requests\nQualifications:\n1 year prior experience in a medical records department or like setting preferred\nMinimum of 6 months prior inbound call center experience required\nStrong technical\/computer skills\nGeneral working knowledge of Microsoft Word & Excel\nGreat communication skills\nMust be able to multi-task\nMust be able to type 50 wpm\nMust be able to use fax, copier, scanning machine\nMust be willing to learn new equipment and processes quickly\nMust be self-motivated, a team player and have proven customer satisfaction skills\nUnderstanding of HIPAA Privacy laws and compliance standards\n\n\nPhysical Requirements:\nAbility to sit or stand for long periods of time\nPhysical ability to lift and carry 25 lbs. of materials\nManual dexterity and strength sufficient enough to enter information via computer keyboard for long periods of time, to write notes and information needed, and to pick up and hold paperwork, supplies and other items.\nEyesight sufficient to effectively read documents and to accurately view information on a computer monitor\nSpeaking and hearing ability sufficient to effectively communicate.\nEye\/hand coordination, hearing and visual acuity necessary for day to day tasks\n\nInformation Governance Accountabilities:\nA high-level understanding of the organization's information governance program and role-specific accountabilities\nA thorough understanding of role requirements, including policies, procedures and processes, to include how individual work impacts the organization and its strategic and financial goals; and how tasks and projects affect the integrity of the organization's data and information\nCommitment to discuss questions and recommendations about processes and any observed variations in performing tasks in order to ensure a standardized approach to work and services provided\nParticipation in education as required for corporate compliance and role-specific functions and tasks","salary":"NOT_FOUND","date":"Just posted","full_text":"NOT_FOUND"},{"unique_id":"p_bce2056688558081","city":"Massachusetts","job_qry":"data","job_title":"Senior Data Engineer - Orpheus, a McKinsey company","company_name":"McKinsey & Company","location":"Waltham, MA 02451","link":"https:\/\/www.indeed.com\/viewjob?jk=bce2056688558081","summary":"QUALIFICATIONS\n5+ years of relevant professional work experience with a reputed procurement consultancy, spend analytics solution or ERP implementer\nUndergraduate degree required (Business or STEM related field a plus)\nDeep understanding of ERP data models (e.g. SAP, Oracle, Infor, Axapta), especially in the financial “FI” and material master “MM” modules\nStrong coding knowledge\/ abilities in the field of large data handling through Microsoft SQL (T-SQL), Microsoft SQL Server Management Studio, data manipulation and ETL tools using Alteryx; alongside knowledge of VBA \/Macros\nJava development skills, PowerShell or other scripting experience will be added advantage\nUnderstanding of data warehousing, data lake concepts and Tableau dashboards, visualizations, etc\nBasic understanding of purchasing, procurement processes, sourcing and saving opportunity identification will be an advantage\nSolid problem-solving capabilities, including the ability to disaggregate issues, identify root causes and recommend solutions\nStrong interpersonal, written\/verbal communications skills\nWillingness to travel (30-50% of time)\nWHO YOU'LL WORK WITH\nYou’ll be working with our Orpheus team based in our Waltham office.\nThis group is part of our Product Development and Procurement (PDP) service line within the Operations Practice. You will be joining McKinsey’s fastest growing team in the procurement arena and taking cutting edge technology solutions to clients.\nOrpheus infuses best-in-class technology and AI-based analytics with deep supply-market and category-sourcing expertise. You’ll be part of a team that is a core element of the digitally-enabled procurement function of the future. This will involve all business value chain activities from product development to distribution and playing a strategic role in managing budgets and costs, anticipating and mitigating supply risk, driving compliance, and generating transparency to external Spend in an organization.\nWHAT YOU'LL DO\nYou will deliver and implement Orpheus together with our strong delivery teams and in close collaboration with our consulting teams, as well as directly with clients.\nA typical project involves the following steps: Project scoping, data identification and extraction, data processing, engineering and enrichment, data cleansing and categorization, spend analysis and opportunity identification, handover, insights presentation and capability building.\nYour main expertise and responsibility will be data identification and extraction. Leveraging proprietary and third-party data-extraction tools (e.g. Snaplogic), you will identify spend relevant data from general ledger, purchase order, material & supplier master and other relevant tables within ERP or data\/business warehouse applications.\nYou will conduct data assessment, perform data quality checks, transform and load raw data using SQL and ETL tools. With your experience in data engineering and data models you will build sustainable data pipelines and adjust them for special needs.\nIn addition to project delivery, you will contribute and sometime lead operational improvements in exiting solutions. You’ll contribute in building out further proprietary solutions or data assets, identifying new technologies, trends, or alternative vendors for us to work with. You will ensure digital procurement assets, vendors, and processes adhere to our standards and that client information and data is safeguarded to the utmost level.","salary":"NOT_FOUND","date":"Just posted","full_text":"NOT_FOUND"},{"unique_id":"p_e79708ab07dffe20","city":"Massachusetts","job_qry":"data","job_title":"Visitor Services Representative","company_name":"Cape Ann Museum","location":"Gloucester, MA 01930","link":"https:\/\/www.indeed.com\/viewjob?jk=e79708ab07dffe20","summary":"Job SummaryReporting to the Visitor Services Manager, Visitor Services Representatives are the first contact with Museum visitors and play a vital role in providing a quality visitor experience. Successful candidates must be comfortable working in a fast-paced environment, as they perform a variety of duties including selling general admission, event and programming tickets as well as Museum Memberships while providing exceptional customer services in person and over the phone.Key ResponsibilitiesProvide a warm and engaging customer service experience to all visitors and maintain a well-informed, working knowledge of Museum exhibitions, partnerships and public programs.Assist with daily operations including, admissions sales, event and programming tickets, membership processing and data collection.Facilitate visitor support and wayfinding, manage entrance lobby to ensure timely and courteous processing of both individual and group visitors.Process gift shop sales and assist with entering gift shop inventory and product restocking.Respond to general telephone and email inquiries.Maintain cleanliness and organization of entrance lobby and front desk, re-stock museum maps, membership brochures and program guides as needed.Support the general operations and activities of the Museum in other duties as assigned by the Visitor Services Manager.Assist docents in preparation of guided tours.QualificationsExcellent customer service and communication skills.At least 6 months of related experience including; cash handling experience preferred.Poise, maturity, flexibility and aptitude to work as a collaborative team player in multi-tasking environment with demonstrated flexibility to meet shifting demands and priorities.Knowledge of ticketing and point of sales system as well as strong computer skills including MS Word and Excel.Appreciation of the Museum’s mission preferred.Ability to work some nights, early mornings and weekends as events and meetings require.Capability to lift up to 20Ibs and capacity to stand for extended periodsThurs-Sun 10 a.m. - 3 p.m.Some flexibility may be required.The Cape Ann Museum is committed to diversity among its employees and encourages qualified candidates from all backgrounds to apply.Job Type: Part-timePay: From $15.00 per hourSchedule:WeekendsCOVID-19 considerations:To keep our employees safe, we have installed a glass divider at the reception desk and we provide masks, gloves and hand sanitizer. We follow all CDC recommendations.Experience:customer service: 1 year (Preferred)Education:High school or equivalent (Preferred)Work Location:One locationMultiple locationsCommunication method(s) used:EmailPhoneIn personTypical start time:10AMTypical end time:5PMWork Remotely:No","salary":"\nFrom $15 an hour","date":"Just posted","full_text":"NOT_FOUND"},{"unique_id":"p_2f422eee572b9ab9","city":"Massachusetts","job_qry":"data","job_title":"Senior Assessor Analyst","company_name":"City of Springfield, MA","location":"Springfield, MA","link":"https:\/\/www.indeed.com\/viewjob?jk=2f422eee572b9ab9","summary":"Position Purpose\/Summary\nResponsible for analyzing and maintaining complete, accurate, and current land and building records in compliance with data standards and practices and in support of property valuations and the tax levy. Responsible for ensuring the accuracy and uniformity of information within and across the valuation software, Geographic Information System, tax billing and collection programs and all files essential to department operations. Work is performed in accordance with accepted practices, laws, regulations, and ordinances with review by the Chairman of the Board of Assessors. Some direct supervision is exercised over staff.\n\nEssential Functions\nResponsible for the process of examining and interpreting recorded deeds and plans and for changing assessing and billing records to reflect land parcel changes and ownership and address changes.\nObtains appropriate records such as deeds and maps for alteration of land dimensions of parcels, i.e. metes and bounds.\nProvides records to Public Works engineers to enable the alteration of parcels on the Geographic Information System (GIS).\nResponsible for the timely maintenance of land and building data on the valuation software and ensuring the data conforms to the data definitions and standards of uniformity and accuracy.\nProvides support to the annual collection of property income and expense data.\nProvides support to the cyclical inspection process such as preparing files and printing letters.\nResponsible for the process of determining whether property sales qualify as valid market sales for inclusion in the development of valuations, and for the entry of codes in iasWorld.\nAssists the board in the preparation of the official property sales file for submittal to the Massachusetts Department of Revenue (MDOR) annually.\nDevelops, maintains, and prepares data files to ensure compliance with the Massachusetts Department of Revenue (DOR) requirements for documentation of tax base growth and other assessing standards in the tax rate process.\nPrepares official warrants for preliminary and final tax commitments.\nResponsible for maintaining accurate files of applications and forms pertaining to exemptions to properties owned by qualifying organizations.\nResponsible for the statutory personal exemption program pertaining to senior citizens, surviving spouses, veterans, blind, and others. Assists taxpayers, prepares applications and supporting materials for board consideration, enters amounts on billing file, sends notices of decision to taxpayers, prepares DOR reimbursement forms.\nResponsible for the overvalue abatement process, preparing materials for the board, calculating abatements and posting timely and accurately on the billing records, causing the sending of notices of decision\nMaintains accurate and current accounting of abatements and exemptions in the overlay reserve account\nResponsible for recording tax title documents and changing taxable status of properties.\nResponsible for monitoring compliance of properties subject to alternative revenue programs such as Chapter 121A projects and organizations making payments-in-lieu-of –taxes.\nPrepares analytical and statistical reports as requested by the Chairman.\nOversees the fiscal activities of the department, including accounts receivable and payable, requisitions, purchase orders, procurement and contracts, etc.\nGenerates Abutters lists for special permits and zone changes. Updates new parcels and prints maps. Runs queries.\nGenerates regular abatement total reports for Comptrollers. Creates new, omitted and revised tax bills, etc.\nProvides customer service on the telephone, regular and electronic mail, and at the public counter.\nProvides assistance with fulfilling public records requests as needed.\nAssists with personal property data entry for value and billing purposes and with customers and other staff regarding abatement activities as needed\nAssists with Motor vehicle excise billing and abatements as needed\nPerforms related work as required.\nKnowledge, Skills, and Abilities\nGeneral knowledge of the principles, methods and techniques of real property valuation.\nDetailed knowledge of the creation, interpretation, and maintenance of real estate records, documents, and maps, etc. Assessor's Office.\nGeneral knowledge of laws, rules and regulations governing real estate tax billing and assessments.\nGeneral knowledge of local real estate values and trends.\nAbility to assemble, develop, analyze, and evaluate data regarding real estate\nAbility to establish and maintain effective working relationships with officials and the general public.\nAbility to express oneself clearly and concisely, both orally and in writing.\nEducation and Experience\nBachelor's degree with course work in public or business administration, economics, mathematics, information technology.\nMinimum of three years of experience in real estate, law, finance, banking, insurance or other employment relevant to functions and operations of the Assessor's Office.","salary":"\n$54,912 a year","date":"Just posted","full_text":"NOT_FOUND"},{"unique_id":"p_144dd3ee3cf31ddc","city":"Massachusetts","job_qry":"data","job_title":"Quality Assurance Field Agent","company_name":"Sales Partnerships","location":"Framingham, MA","link":"https:\/\/www.indeed.com\/viewjob?jk=144dd3ee3cf31ddc","summary":"Sales Partnerships is the most-awarded B2B field sales and marketing outsourcing organization in North America. We partner with respected brands to identify their highest-value opportunities, address their most critical market challenges, and accelerate revenue. Our customized approach combines CRM, GIS, big data analytics, and customer data with tightly controlled processes and highly-trained sales staff. This approach ensures our clients develop deeper market insights and predictable revenue.Our busy, growing sales outsourcing agency is looking for an organized, energetic, and reliable professional to join our amazing team. This is a critical support staff position that will employ a variety of consultative customer service and sales effectiveness techniques to market program initiatives on behalf of our client, a Fortune 100 business, and one of the most respected financial services companies in the world.You will be responsible for promoting our client’s value to small and medium-sized business accounts to ensure brand awareness in a designated territory. You should be comfortable and efficient in territory management, hitting assigned metrics, documentation and reporting, accountability, along with having a strong attention to detail.Apply: Framingham, MA: https:\/\/jobs.lever.co\/salespartnerships\/b0a5da6b-1be5-4b17-a357-bd25b313a4e3Quincy, MA: https:\/\/jobs.lever.co\/salespartnerships\/8db04afd-720a-4c9d-82f9-e73d38273824Worcester, MA: https:\/\/jobs.lever.co\/salespartnerships\/cf6fcbd7-d65b-46c8-b88b-c92294952f5cPhysical Requirements: Access to reliable transportation based on territory requirements. Possess and maintain a valid driver's license. Able to obtain and maintain automobile insurance at or above Company minimum requirements.Working in territory approximately 8 hours each working day. Normal business hours are usually 9am to 5pm, Monday - Friday.Prolonged periods of traveling from business to business in order to conduct in-person meetings. Must be able to travel to businesses within territory and meet with decision makers in person. This typically involves meeting with around 30+ businesses daily.Ability to lift and carry up to 15 pounds at a time.Required Skills\/Abilities: Excellent interpersonal and customer service skillsExcellent organizational skills and attention to detailStrong analytical and problem solving skillsAbility to function well in a high-paced and at times stressful environmentProficient in using Company issued devices (iPhones, iPads) and CRM systems to manage and document daily activitiesAble to effectively present and educate businesses on our client’s brand valueBachelor’s Degree in Business, Marketing, Sales or related field or at least 2+ years related experience strongly preferred.***Please follow the link below to directly apply and one of our recruiters will reach out to schedule an info\/screening call***Apply: Framingham, MA: https:\/\/jobs.lever.co\/salespartnerships\/b0a5da6b-1be5-4b17-a357-bd25b313a4e3Quincy, MA: https:\/\/jobs.lever.co\/salespartnerships\/8db04afd-720a-4c9d-82f9-e73d38273824Worcester, MA: https:\/\/jobs.lever.co\/salespartnerships\/cf6fcbd7-d65b-46c8-b88b-c92294952f5cSales Partnerships is an Equal Opportunity Employer. We respect and seek to empower each individual and support the diverse cultures, perspectives, skills and experiences within our workforce.Job Type: Full-timePay: $80,000.00 per yearBenefits:401(k) matchingDental insuranceHealth insuranceLife insurancePaid time offVision insuranceSchedule:Monday to FridayCOVID-19 considerations:During the COVID-19 pandemic, additional requirements to follow social distancing protocols, hygiene standards and wearing personal protective equipment apply.Work Location:Multiple locationsOn the roadPaid Training:YesManagement:Team LeadTypical start time:9AMTypical end time:5PMCompany's website:https:\/\/www.salespartnerships.com\/Benefit Conditions:Waiting period may applyWork Remotely:No","salary":"\n$80,000 a year","date":"Just posted","full_text":"NOT_FOUND"},{"unique_id":"p_5849c26f169852a1","city":"Massachusetts","job_qry":"data","job_title":"Program Administrator","company_name":"TUFTS University","location":"Boston, MA 02111 (Chinatown area)","link":"https:\/\/www.indeed.com\/viewjob?jk=5849c26f169852a1","summary":"The Medical School Dean's Office is responsible for the overall academic and administrative functions of the School. The Dean's Office oversees the School's academic departments, the teaching and research enterprises, student services, and facilities. Functions include communications, financial and strategic planning, resource allocation, human resource management, and facility management and renovations.\n\n\nThis individual administers the Global Health Programs and manages all administrative tasks associated with them including publicizing, disseminating information, managing applications, answering student questions, planning related events, and maintaining reports and evaluations of the program. This individual also performs complex administrative support for the Dean for Multicultural Affairs & Global Health\/Associate Provost and CDO, as well as for the Assistant Dean for Multicultural affairs and the Office for Multicultural Affairs in general. Major responsibilities include managing calendars for both deans, writing and editing reports, researching and compiling data, providing support for committees and events, and carrying out evaluations and surveys. The incumbent will act as an Office for Multicultural Affairs liaison, answering questions and communicating on behalf of the office or directing concerns to the appropriate individual. This person also assists the Dean with special projects, including grant management for the office of Global Health. Must be able to partner and build relationships with others throughout the University and the Medical School.\n\n\nQualifications\n\nBasic Requirements:\n\n3+ years working with senior management in a project\/ administrative support role.\nBachelor’s degree.\nAdvanced Microsoft Office applications, particularly Word, Excel, Outlook, and PowerPoint.\n\nExperience with Qualtrics or other survey software is a bonus.\n\nExcellent oral and written communication skills including solid proofreading and editing skills. Strong project management skills.\nAbility to work a diverse environment with a variety of stakeholders.\n\nMust have professional demeanor, must be poised and able to multitask.\n\nStrong interpersonal skills.\n\nMust be an independent, self motivated problem solver who can also work within a team environment.\nPreferred Qualifications:\n\nExperience in Global Health operations and in grant support is preferred.\n\nPrior experience coordinating large scale events and conferences a plus.\n\nPrior experience in an academic or health related work environment is desired.\n\nSpecial Work Schedule Requirements:\nOccasional evening availability is required for certain events\n\nAn employee in this position must complete all appropriate background checks at the time of hire, promotion, or transfer.\n\nEqual Opportunity Employer – minority\/females\/veterans\/disability\/sexual orientation\/gender identity.\n\n\nPrimary Location: United States-Massachusetts-Boston\nJob: Academic Programs\nOrganization: Administration - Medical\nEmployee Status: Regular\n\nSchedule: Full-time\nJob Posting: Aug 24, 2020, 8:57:35 AM","salary":"NOT_FOUND","date":"Just posted","full_text":"NOT_FOUND"},{"unique_id":"pj_f51111fef22a9e44","city":"Massachusetts","job_qry":"data","job_title":"Director of Dining Services","company_name":"Parsons Hill Rehabilitation & Health Care Center","location":"NOT_FOUND","link":"https:\/\/www.indeed.com\/viewjob?jk=f51111fef22a9e44","summary":"Dining DirectorThe primary purpose of your position is to assume responsibility for planning, organizing, developing and directing the overall operation of the Dining Services Department in accordance with current federal, state, and local standards, guidelines, and regulations governing our facility, and as may be directed by the Administrator and\/or Corporate Director of Food Service Administration to assure that quality nutritional services are provided on a daily basis and insure that the dining services department is maintained in a clean, safe, and sanitary manner.SCOPE OF RESPONSIBILITYAs the Director of Dining Services, you are responsible and accountable to carry out your assigned duties. You report directly to the Administrator.JOB FUNCTIONEvery effort has been made to keep your job description as complete as possible. However, it in no way states or implies that these are the only duties you will be required to perform. The omission of specific statements of duties does not exclude them from the position, the position includes any other duties deemed appropriate and assigned by the Administrator and\/or Corporate Director of Food Service Administration.WORKING CONDITIONSWorks in office areas as well as throughout the facility’s dining services and throughout facility areas (i.e., dining rooms, resident rooms, activity rooms, etc.).Sits, stands, lifts, and moves intermittently during working hours.Is subject to frequent interruptions.Is involved with residents, personnel, visitors, government agencies\/personnel, etc., under all conditions\/circumstances.Is subject to hostile and emotionally upset residents, family members, etc.Communicates with the medical staff, nursing staff and other department supervisors.May be exposed to heat\/cold temperatures in kitchen\/storage areas.Works beyond normal duty hours, on weekends and holidays when necessary in other positions temporarily when necessary. Scheduled hours may change to meet the needs of the facility.Attends and participates in continuing educational programs.Is subject to falls, burns from equipment, odors, exposure from chemicals, etc., throughout the workday.Maintains a liaison with other department supervisors to adequately plan for dining services activities.EDUCATION REQUIREMENTSMust possess, as a minimum a high school diploma. Must have completed an accredited course in dietic training approved by the American Dietetic Association and state agencies.EXPERIENCEA minimum of two (2) years experience in a supervisor capacity in a hospital, skilled nursing care facility or other related medical field is preferred. Must have training in cost control, food management, diet therapy, etc.SPECIFIC REQUIREMENTSMust be able to read, write, speak and understand the English language.Must possess the ability to make independent decisions when circumstances warrant such action.Must possess the ability to deal tactfully with personnel, residents, family members, visitors, government agencies\/personnel and the general public.Must be knowledgeable of dining service practices and procedures as well as the laws, regulations and guidelines governing dining services functions in the long-term care facility, including JCAHO.Must possess leadership ability and willingness to work harmoniously with and supervise professional and non-professional personnel.Must have the ability to plan, organize, develop, implement and interpret the programs, goals, objectives, policies, procedures, etc., of the Dining Services Department.Must maintain the care and use of supplies, equipment, etc., and maintain the appearance of dining service areas, must perform regular inspections of dining services area for sanitation order, safety, and proper performance of assigned duties.Must have patience, tact, cheerful disposition and enthusiasm, as well as the willingness to handle residents based on whatever maturity level they are currently functioning.Must possess the ability to seek out new methods and principles and be willing to incorporate them into existing dining services practices.Must be able to read and interpret dining services cost reports, financial data, etc.Must be able to relate information concerning a resident’s condition.PHYSICAL AND SENSORY REQUIREMENTS(With or Without the Aid of Mechanical Devices)Must be able to move intermittently throughout the day.Must be able to speak and write the English language in an understandable manner.Must be able to cope with the mental and emotional stress of the position.Must possess sight\/hearing senses or use prosthetics that will enable these senses to function adequately so that the requirements of this position can be fully met.Must function independently, have flexibility, personal integrity, and the ability to work effectively with the residents, personnel , and support agencies.Must be in good general health and demonstrate emotional stability.Must be able to relate to and work with ill, disabled, elderly, emotionally upset, and at times, hostile people within the facility.Must be required to lift, push, pull and move equipment, supplies etc., without restriction.Must be able to assist in the evacuation of residents in an emergency situation.MAJOR DUTIES AND RESPONSIBILITIESMeet sanitation standards.Must be able to provide point of service meal delivery.Follow all therapeutic diet guidelines including proper temperatures and serving times.Educate department staff in all aspects of dining service functions.Assure the planning, preparation, and serving of all therapeutic diets.Maintain all dining service equipment in a clean, and safe manner.Maintain sufficient inventory according to policy\/procedure including emergency supply.Assure that staff is screened for communicable disease.Formulate menu planning with guidelines of dietician.Assure that menus are accurately adhered to and appropriate substitutions are made per policy.Delegate authority to competent staff in his\/her absence.Provide dining services for any\/all in-house functions.Ensure quality and quantity of all deliveries.Demonstrate correct safety techniques.Respect and take care of facility equipment and is not wasteful of supplies.Contribute to effective communication and pleasant working conditions.Contribute to and promote positive resident and family relations.Follow facility policies and procedures.Is knowledgeable in and ensures staff comply with privacy practices to protect residents’ health information.Continue growth and expand job knowledge.Demonstrate leadership skills.Maximize the potential of each employee supervised and maintain up to date evaluations.CORPORATE COMPLIANCEFully complies with all federal and state laws and standards of ethical and professional conduct applicable to the position.Knowledge about laws and regulations relating to job responsibilities, e.g., EEO, OSHA, patient rights, fraud\/abuse laws.Is consistently truthful and accurate in all written and verbal communication.Demonstrates adherence to employee code of ethics and conduct. (Refer to personnel policies).Exhibits ethical\/moral responsibility in problem resolution and decision making.Required documentation\/record keeping is accurate, complete and timely.Reports suspected violations of federal and state laws and any types of misconduct to facility administrator, or other appropriate staff member.ACKNOWLEDGEMENTI have read this job description, reviewed the performance evaluation, and fully understand the requirements set forth therein. I hereby accept the position of Director of Dining Services and agree to abide by the requirements set forth and will perform all duties and responsibilities to the best of my ability.I further understand that my employment is at-will and thereby understand that my employment can be terminated at-will by the facility or myself, and that such termination can be made with or without notice.__________________ _____________________________________________Date Signature – Director of Dining Services__________________ _____________________________________________Date Signature - AdministratorJob Type: Full-timeSchedule:Monday to FridayExperience:Food: 1 year (Preferred)Management: 1 year (Preferred)Food Service Management: 1 year (Preferred)Food & Beverage Management: 1 year (Preferred)Work Location:One locationWork Remotely:No","salary":"NOT_FOUND","date":"Just posted","full_text":"NOT_FOUND"}]